simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
/*******************************************************************************
* main.c — Firmware PSoC unificado para geófono (GEO) y martillo (HAMMER).
*
* El hardware del TopDesign determina automáticamente el modo de compilación:
*   Si el proyecto tiene PGAgain  → PSOC_HW_CLASS = GEO
*   Si el proyecto tiene PGA      → PSOC_HW_CLASS = HAMMER
* No hay que cambiar nada en este archivo al cambiar de proyecto.
*
* ─────────────────────────────────────────────────────────────────────────────
*  GEO — componentes TopDesign:
*    UART, ADC, AMux_ADC, VDAC_ref_*, PGAgain, OPAref, PGAp,
*    PGAn, LPF_1, LPF_2, OPAbp, OPAadder, OPAlp, Timer, LED, isr_*.
*
*  HAMMER — componentes TopDesign (simplificado en "Precambios", ya sin
*  etapa de referencia de entrada separada):
*    UART, ADC, AMux_ADC, VDAC_PGA, VDAC_LP,
*    PGA, Opa_ref_PGA, Opa_LP, LPF_ADC, Timer, LED.
* ─────────────────────────────────────────────────────────────────────────────
*
* Cadena: MATLAB → maestro → esclavo (ESP-NOW) → PSoC (UART).
* El PSoC muestrea N lotes de 30 muestras RAW, los guarda en RAM
* sin UART durante la ventana crítica, y recién después los envía al ESP.
* El arranque del muestreo es por el pin digital SYNC_IN (lo maneja el ESP).
*
* TX UART — frame de datos RAW (95 bytes):
*   [0xAB][n=30][seq_lo][seq_hi] + 30×3 bytes (raw LE: b0,b1,b2) + [crc XOR]
*
* RX UART — comandos con checksum XOR:
*   1 param : [0xAB][cmd][param][cmd^param]
*       0xA5 status/probe   0xA6 set PGA (0-8)       0xA9 legacy ACK
*       0xAA legacy ACK     0xB1 arm (espera SYNC)   0xB3 debug rampa (0/1)
*       0xB4 start-now      0xB5 calibrar refs       0xC1 pong
*   2 param : [0xAB][0xA3][n_lo][n_hi][0xA3^n_lo^n_hi]   (set N lotes)
*
* Detección PSoC ↔ ESP:
*   PSoC → ESP : [0xAB][0xC0][0x00][0xC0]             (ping)
*   ESP  → PSoC: [0xAB][0xC1][0x00][0xC1]             (pong)
*   PSoC → ESP : [0xAB][0xC2][cmd][val][0xC2^cmd^val]  (config ACK)
*******************************************************************************/

#include "project.h"
#include "psoc_hw.h"
#include "psoc_adc.h"
#include "sd_spi.h"
#include "calibration.h"
#include "psoc_nv.h"
#include "LED.h"
#include "DMA_DelSig_RAM_dma.h"
#include "DMA_Filter_RAM_dma.h"
#include "DMA_DelSig_Filter_dma.h"
#include "Filter.h"
#include "Filter_PVT.h"
#include "ctrl.h"
#include "cfg.h"
#include "reset.h"
#include "status.h"
#include "error.h"
#include "state.h"
#include "isr_SuperMaquina.h"
#include "isr_Timer.h"
#include "isr_Timer_1.h"
#include "isr_Timer_2.h"
#include "isr_Timer_3.h"
#include "tmr_event.h"
#include "filter_coeffs.h"
#include "FIR_adquisition.h"
#include "psoc_debug.h"
/* -------------------------------------------------------------------------- */
#define LEGACY_VDAC_SHADOW_INIT 0x9Cu

#if defined(CY_STATUS_REG_tmr_event_H)
#define timer_event_Read tmr_event_Read
#endif

#if defined(isr_Timer__INTC_MASK)
#define isr_Timer_SetPriority(priority)   (*(isr_Timer_INTC_PRIOR) = ((uint8)(priority) << 5))
#define isr_Timer_Disable()               (*(isr_Timer_INTC_CLR_EN) = isr_Timer__INTC_MASK)
#define isr_Timer_ClearPending()          (*(isr_Timer_INTC_CLR_PD) = isr_Timer__INTC_MASK)
#else
#define isr_Timer_SetPriority(priority)   ((void)(priority))
#define isr_Timer_Disable()               ((void)0)
#define isr_Timer_ClearPending()          ((void)0)
#endif

#if defined(isr_Timer_1__INTC_MASK)
#define isr_Timer_1_SetPriority(priority) (*(isr_Timer_1_INTC_PRIOR) = ((uint8)(priority) << 5))
#define isr_Timer_1_Disable()             (*(isr_Timer_1_INTC_CLR_EN) = isr_Timer_1__INTC_MASK)
#define isr_Timer_1_ClearPending()        (*(isr_Timer_1_INTC_CLR_PD) = isr_Timer_1__INTC_MASK)
#else
#define isr_Timer_1_SetPriority(priority) ((void)(priority))
#define isr_Timer_1_Disable()             ((void)0)
#define isr_Timer_1_ClearPending()        ((void)0)
#endif

#if defined(isr_Timer_2__INTC_MASK)
#define isr_Timer_2_SetPriority(priority) (*(isr_Timer_2_INTC_PRIOR) = ((uint8)(priority) << 5))
#define isr_Timer_2_Disable()             (*(isr_Timer_2_INTC_CLR_EN) = isr_Timer_2__INTC_MASK)
#define isr_Timer_2_ClearPending()        (*(isr_Timer_2_INTC_CLR_PD) = isr_Timer_2__INTC_MASK)
#else
#define isr_Timer_2_SetPriority(priority) ((void)(priority))
#define isr_Timer_2_Disable()             ((void)0)
#define isr_Timer_2_ClearPending()        ((void)0)
#endif

#if defined(isr_Timer_3__INTC_MASK)
#define isr_Timer_3_SetPriority(priority) (*(isr_Timer_3_INTC_PRIOR) = ((uint8)(priority) << 5))
#define isr_Timer_3_Disable()             (*(isr_Timer_3_INTC_CLR_EN) = isr_Timer_3__INTC_MASK)
#define isr_Timer_3_ClearPending()        (*(isr_Timer_3_INTC_CLR_PD) = isr_Timer_3__INTC_MASK)
#else
#define isr_Timer_3_SetPriority(priority) ((void)(priority))
#define isr_Timer_3_Disable()             ((void)0)
#define isr_Timer_3_ClearPending()        ((void)0)
#endif

#if defined(Tmr_UartRxWatchdog_STATUS_TC) && !defined(Timer_STATUS_TC)
#define Timer_Init               Tmr_UartRxWatchdog_Init
#define Timer_Stop               Tmr_UartRxWatchdog_Stop
#define Timer_Start              Tmr_UartRxWatchdog_Start
#define Timer_Enable             Tmr_UartRxWatchdog_Enable
#define Timer_WritePeriod        Tmr_UartRxWatchdog_WritePeriod
#define Timer_WriteCounter       Tmr_UartRxWatchdog_WriteCounter
#define Timer_ReadStatusRegister Tmr_UartRxWatchdog_ReadStatusRegister
#define Timer_STATUS_TC          Tmr_UartRxWatchdog_STATUS_TC
#define Timer_initVar            Tmr_UartRxWatchdog_initVar
#endif

#if defined(Tmr_PingCalTick_STATUS_TC) && !defined(Timer_1_STATUS_TC)
#define Timer_1_Init               Tmr_PingCalTick_Init
#define Timer_1_Stop               Tmr_PingCalTick_Stop
#define Timer_1_Start              Tmr_PingCalTick_Start
#define Timer_1_Enable             Tmr_PingCalTick_Enable
#define Timer_1_WritePeriod        Tmr_PingCalTick_WritePeriod
#define Timer_1_WriteCounter       Tmr_PingCalTick_WriteCounter
#define Timer_1_ReadStatusRegister Tmr_PingCalTick_ReadStatusRegister
#define Timer_1_STATUS_TC          Tmr_PingCalTick_STATUS_TC
#define Timer_1_initVar            Tmr_PingCalTick_initVar
#endif

#if defined(Tmr_LedWait_STATUS_TC) && !defined(Timer_2_STATUS_TC)
#define Timer_2_Init               Tmr_LedWait_Init
#define Timer_2_Stop               Tmr_LedWait_Stop
#define Timer_2_Start              Tmr_LedWait_Start
#define Timer_2_Enable             Tmr_LedWait_Enable
#define Timer_2_WritePeriod        Tmr_LedWait_WritePeriod
#define Timer_2_WriteCounter       Tmr_LedWait_WriteCounter
#define Timer_2_ReadStatusRegister Tmr_LedWait_ReadStatusRegister
#define Timer_2_STATUS_TC          Tmr_LedWait_STATUS_TC
#define Timer_2_initVar            Tmr_LedWait_initVar
#endif

#if defined(Tmr_CaptureWatchdog_STATUS_TC) && !defined(Timer_3_STATUS_TC)
#define Timer_3_Init               Tmr_CaptureWatchdog_Init
#define Timer_3_Stop               Tmr_CaptureWatchdog_Stop
#define Timer_3_Start              Tmr_CaptureWatchdog_Start
#define Timer_3_Enable             Tmr_CaptureWatchdog_Enable
#define Timer_3_WritePeriod        Tmr_CaptureWatchdog_WritePeriod
#define Timer_3_WriteCounter       Tmr_CaptureWatchdog_WriteCounter
#define Timer_3_ReadStatusRegister Tmr_CaptureWatchdog_ReadStatusRegister
#define Timer_3_STATUS_TC          Tmr_CaptureWatchdog_STATUS_TC
#define Timer_3_initVar            Tmr_CaptureWatchdog_initVar
#endif

/* FILTER_FIR_NTAPS vive en filter_coeffs.h (unica fuente de verdad,
 * compartida con calibration.c). El descarte del retardo de grupo (63
 * muestras) lo hace el ARM con g_fir_discard. superMaquina mantiene el FIR
 * alimentado en ARMED y el objetivo de hardware se extiende para no perder
 * lotes utiles al final. */
#define FILTER_GROUP_DELAY ((FILTER_FIR_NTAPS - 1u) / 2u)   /* 63 muestras */

#ifndef PSOC_LOAD_NV_CAL_ON_BOOT
#define PSOC_LOAD_NV_CAL_ON_BOOT 1u
#endif
#define TIMER_ILO_COUNTS_PER_MS 100u     /* Timers fixed @ 100 kHz. */
#define TIMER_MAX_COUNTS        60000UL  /* margen bajo 0xFFFF para rearmar FF one-shot */
#define UART_RX_TIMEOUT_MS      10u
#define TIMEOUT_COUNTS          (UART_RX_TIMEOUT_MS * TIMER_ILO_COUNTS_PER_MS)

#define BATCH_SAMPLES      30u
#define FRAME_BYTES        (4u + BATCH_SAMPLES * 3u + 1u)   /* 95 */
#define SAMPLE_BYTES       3u
#define CAPTURE_BATCH_BYTES (BATCH_SAMPLES * SAMPLE_BYTES)

#ifndef PSOC_CAPTURE_MAX_BATCHES
#define PSOC_CAPTURE_MAX_BATCHES 512u
#endif

