simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
#define PING_PERIOD_MS     700u
#define PING_OFF_MS        100u
#define IDLE_PING_MS       1000u
#define COMM_BLINK_MS      200u  /* medio-período del parpadeo del LED (~2.5 Hz, visible) */
#define CONNECT_BLINK_MS   80u

/* Titilar LED (identificación de nodo): parpadeo NO bloqueante servido por
 * Timer_2. Al recibir PSOC_CMD_BLINK_LED se arma una cadena de one-shots; el
 * LED titila y luego vuelve a su reposo (encendido fijo). */
#define IDENTIFY_BLINK_WINDOW_MS  8000u
#define IDENTIFY_BLINK_TOGGLES    ((IDENTIFY_BLINK_WINDOW_MS + COMM_BLINK_MS - 1u) / COMM_BLINK_MS)

#ifndef PSOC_DIAG_ENABLE
#define PSOC_DIAG_ENABLE      1
#endif

#ifndef PSOC_RAMP_DEBUG_ENABLE
#define PSOC_RAMP_DEBUG_ENABLE 1
#endif

#ifndef PSOC_EARLY_UART_TEST
#define PSOC_EARLY_UART_TEST  0
#endif

#ifndef PSOC_TX1_BITBANG_TEST
#define PSOC_TX1_BITBANG_TEST  0
#endif

#ifndef PSOC_TX1_GPIO_TEST
#define PSOC_TX1_GPIO_TEST     0
#endif

#ifndef PSOC_BUTTON_CAL_ENABLE
#define PSOC_BUTTON_CAL_ENABLE 1
#endif

/* -------------------------------------------------------------------------- */
/* Buffers destino DMA — 3 bytes LE (24 bits signed) por muestra */
static volatile uint8  g_dma_raw_buf[3]   = {0u, 0u, 0u};
static volatile uint8  g_dma_filt_buf[3]  = {0u, 0u, 0u};

/* 0 = enviar crudo (default); 1 = enviar filtrado por FIR hardware */
static volatile uint8  g_stream_mode      = 0u;

/* Buffer plano de captura: N lotes x 30 muestras x 3 bytes. El hot path de la
 * ISR solo copia 3 bytes al puntero de escritura; el alineado de counts se
 * difiere al volcado UART (uart_send_capture_batch). */
static volatile uint8  g_capture_raw[(uint32)PSOC_CAPTURE_MAX_BATCHES * CAPTURE_BATCH_BYTES];
static volatile uint8 * volatile g_capture_wr  = g_capture_raw;
static volatile uint8 * volatile g_capture_end = g_capture_raw;
/* 1 = las muestras guardadas necesitan alineado (division DEC_DIV) al volcar;
 * 0 = rampa debug u otros datos sinteticos que van tal cual. */
static volatile uint8  g_capture_align    = 1u;
static volatile uint8  g_capture_adc_raw  = 1u;
static volatile uint16 g_fir_discard      = 0u;
/* Decimación con promedio: factor de esta corrida (cacheado al armar, ver
 * psoc_adc_get_decimation()) y acumulador de la ISR. Corre DESPUÉS del
 * descarte de transitorio del FIR (g_fir_discard) para no promediar
 * muestras del transitorio. 1 = sin decimar. */
static volatile uint8  g_capture_decim_factor = 1u;
static volatile int32  g_decim_acc        = 0;
static volatile uint8  g_decim_n          = 0u;
static          uint16 g_seq              = 0u;
static volatile uint16 g_batches_captured = 0u;
static volatile uint8  g_capture_done     = 0u;

static uint8  g_pga_code     = PSOC_PGA_DEFAULT_CODE;
static uint8  g_pgavdac_code = PSOC_PGAVDAC_DEFAULT_CODE;

static uint8  g_vdac_val     = LEGACY_VDAC_SHADOW_INIT;

static volatile uint8  g_state        = PSOC_IDLE;
static          uint16 g_n_batches    = 0u;
static volatile uint16 g_batches_sent = 0u;

/* ── Captura encadenada (multi-corrida) ──────────────────────────────────────
 * El contador de lotes crudos de superMaquina topa en PSOC_CAPTURE_MAX_BATCHES
 * (512) lotes CRUDOS por corrida ≈ 5.24 s @ 2929 Hz. Para capturas mas largas
 * que ese trozo de hardware, el PSoC rearma superMaquina y sigue escribiendo en
 * el mismo buffer hasta completar g_total_target lotes DECIMADOS. El volcado
 * UART se hace una sola vez, al final, para que el ESP vea una captura completa
 * y no cierre por DUMP_DONE parcial. Ver docs/plan_2929_decimation_sd.md. */
static volatile uint16 g_total_target = 0u; /* lotes DECIMADOS pedidos en toda la captura */
static volatile uint16 g_total_sent   = 0u; /* lotes DECIMADOS ya volcados al ESP32 (acumulado) */
static volatile uint8  g_chain_active  = 0u; /* 1 = captura multi-corrida en curso */

/* ── Captura a SD (PSOC_CMD_SD_CAPTURE) ──────────────────────────────────────
 * Con g_sd_cap_active, g_capture_raw deja de ser un buffer lineal y pasa a ser
 * un RING de SD_RING_SAMPLES muestras decimadas: la ISR escribe con contadores
 * monotónicos (g_sd_ring_samples) y el main loop drena de a bloques de 512 B a
 * la SD (g_sd_ring_drained) DURANTE el muestreo — la SD sostiene de sobra la
 * tasa media (~2.9-8.8 KB/s) y el ring de 45 KB absorbe los picos de latencia
 * de escritura. Los contadores separados (uno lo escribe solo la ISR, el otro
 * solo el main loop) evitan cualquier RMW compartido. Con el flag apagado el
 * camino RAM-only validado queda byte-idéntico.
 * Layout SD (bloques de 512 B, sin filesystem):
 *   LBA 2048               bloque directorio: "GDIR" + next_free_lba + count
 *   LBA session            header de sesión: "GSES" + id + n_batches + fs + …
 *   LBA session+1 ..       datos: 5 lotes de 90 B por bloque (450 B + padding)
 */
#define SD_CAPTURE_DIR_LBA   2048u
#define SD_CAPTURE_DATA_LBA  2049u   /* primera sesión si el directorio está virgen */
#define SD_BATCHES_PER_BLOCK 5u
#define SD_RING_SAMPLES      ((uint32)PSOC_CAPTURE_MAX_BATCHES * BATCH_SAMPLES)
/* Techo de N con SD: uint16 de SETN menos margen; 60000 lotes ≈ 30 min a 976 Hz. */
#define PSOC_SD_MAX_BATCHES  60000u

static volatile uint8  g_sd_cap_en         = 0u; /* config (0xBE), pedida por el ESP */
static volatile uint8  g_sd_cap_active     = 0u; /* esta captura/dump usa SD */
static volatile uint32 g_sd_ring_samples   = 0u; /* muestras decimadas escritas (solo ISR) */
static          uint32 g_sd_ring_drained   = 0u; /* muestras drenadas a SD (solo main) */
static volatile uint32 g_sd_target_samples = 0u; /* g_total_target * BATCH_SAMPLES */
static volatile uint32 g_sd_drop_samples   = 0u; /* overrun del ring (solo ISR) */
static uint8  g_sd_blk[SD_BLOCK_BYTES];          /* staging drenaje / caché de dump */
static uint16 g_sd_blk_fill        = 0u;
static uint32 g_sd_session_lba     = 0u;
static uint32 g_sd_blocks_written  = 0u;
static uint32 g_sd_dump_blk_cached = 0xFFFFFFFFu;
static uint8  g_sd_err_flags       = 0u;         /* bits de PSOC_EVT_SD_ERROR (solo main) */
static volatile uint8  g_debug_psoc   = 0u;
static          uint32 g_dbg_cnt      = 0u;
static volatile uint8  g_cal_ack_pending = 0u;
#if PSOC_BUTTON_CAL_ENABLE
static volatile uint8  g_cal_button_pressed = 0u;
#endif

