simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
static volatile uint8  rx_state       = 0u;
static volatile uint8  rx_cmd         = 0u;
static volatile uint8  rx_p1          = 0u;
static volatile uint8  rx_p2          = 0u;
static volatile uint8  watchdog_rx    = 0u;

static          uint8  g_esp_connected  = 0u;
static          uint8  g_nv_ready       = 0u;
static          uint8  g_last_calibration_ok = 0u;

/* Mapa de timers fixed (los 4 con rol propio; ver
 * docs/psoc_supermaquina_handoff.md):
 *   Timer   : watchdog del parser UART RX (concurrente con todo lo demas).
 *   Timer_1 : ping boot/idle + tick de calibracion (nunca concurrentes:
 *             la calibracion detiene los pings antes de arrancar).
 *   Timer_2 : LED/esperas cortas, sin multiplexar con nada mas.
 *   Timer_3 : watchdog de captura dedicado. Antes compartia Timer_2 por modo;
 *             dedicarlo elimina el riesgo de que un blink/espera pise el
 *             watchdog (o al reves) si algun dia coinciden. Si se quisiera
 *             reducir a 3 timers, este es el que se pliega de vuelta sobre
 *             Timer_2 (modo CAPTURE_WD) y se elimina del TopDesign. */
#define TIMER1_MODE_NONE       0u
#define TIMER1_MODE_BOOT_PING  1u
#define TIMER1_MODE_IDLE_PING  2u
#define TIMER1_MODE_CAL_TICK   3u

#define TIMER2_MODE_NONE          0u
#define TIMER2_MODE_BOOT_LED_OFF  1u
#define TIMER2_MODE_WAIT          2u
#define TIMER2_MODE_COMM_BLINK    3u

static volatile uint32 g_timer1_remaining_counts = 0u;
static volatile uint8  g_timer1_mode             = TIMER1_MODE_NONE;
static volatile uint8  g_boot_ping_due           = 0u;
static volatile uint8  g_idle_ping_due           = 0u;
static volatile uint8  g_idle_ping_armed         = 0u;

static volatile uint32 g_timer2_remaining_counts = 0u;
static volatile uint8  g_timer2_mode             = TIMER2_MODE_NONE;
static volatile uint8  g_boot_led_off_due        = 0u;
static volatile uint8  g_timer2_wait_done        = 0u;
static volatile uint8  g_comm_blink_due          = 0u;
static volatile uint16 g_comm_blinks_remaining   = 0u;
static volatile uint8  g_comm_led_active         = 0u;

/* Timer_3 es monoproposito (watchdog de captura): no necesita variable de
 * modo, solo el resto de cuenta para el troceado a 60000 counts. */
static volatile uint32 g_timer3_remaining_counts = 0u;
static volatile uint8  g_capture_wd_due          = 0u;
static volatile uint8  g_timer_event_pending     = 0u;

/* ── Circuit-breaker de tormenta de IRQ de timers fixed ──────────────────────
 * Visto en hardware (pyocd): la IRQ de un timer FF puede quedar re-disparando
 * para siempre (VECTACTIVE fijo, ISPR=0, SR0=0, timer parado) y mata el
 * sistema entero; leer el status no la corta, solo deshabilitar la IRQ en el
 * NVIC. Cada ISR cuenta entradas espurias (status==0) consecutivas y al
 * llegar a TIMER_STORM_TRIP se auto-deshabilita y marca su bit; el thread
 * (timer_storm_recover) re-inicializa el bloque, emite diagnostico y restaura
 * el estado del modo que estaba en vuelo. */
#define TIMER_STORM_TRIP 4u
static volatile uint8  g_timer_storm             = 0u;  /* bit0..3 = Timer..Timer_3 */
static volatile uint8  g_t0_spurious             = 0u;
static volatile uint8  g_t1_spurious             = 0u;
static volatile uint8  g_t2_spurious             = 0u;
static volatile uint8  g_t3_spurious             = 0u;

static volatile uint8  g_cal_timer_active        = 0u;
static volatile uint8  g_cal_progress_due        = 0u;
static volatile uint8  g_cal_watchdog_due        = 0u;
static volatile uint32 g_cal_progress_period_ms  = 0u;
static volatile uint32 g_cal_watchdog_remaining_ms = 0u;

/* Margen extra del watchdog de captura sobre la duracion nominal esperada. */
#define CAPTURE_WD_MARGIN_MS  1500u

/* superMaquina control/status map. */
#define CE_CTRL_ARM          0x01u
#define CE_CTRL_START_NOW    0x02u
#define CE_CTRL_STOP         0x04u
#define CE_CTRL_CLEAR_FLAGS  0x08u
#define CE_CTRL_USE_SYNC     0x10u
#define CE_CTRL_LOAD_BATCH_LO 0x20u
#define CE_CTRL_ENGINE_EN    0x40u
#define CE_CTRL_LOAD_BATCH_HI 0x80u

#define CE_CFG_SRC_MASK      0x03u
#define CE_CFG_SRC_RAW       0x00u
#define CE_CFG_SRC_FILTER    0x01u
#define CE_CFG_SRC_COMBINED  0x02u
#define CE_CFG_SRC_DEBUG     0x03u
#define CE_CFG_IRQ_BATCH_EN  0x04u
#define CE_CFG_IRQ_SYNC_EN   0x08u
#define CE_CFG_IRQ_ERROR_EN  0x10u
/* cfg[5..7] libres. El descarte FIR queda en C: ponerlo en PLD/count7
 * compila, pero en placa dejo el camino filtrado por sync retenido. */

#define CE_STATUS_IDLE       0x01u
#define CE_STATUS_ARMED      0x02u
#define CE_STATUS_SAMPLING   0x04u
#define CE_STATUS_DONE       0x08u
#define CE_STATUS_ERROR      0x10u
#define CE_STATUS_BUTTON     0x80u

#define CE_TIMER_EVT_UART       0x01u
#define CE_TIMER_EVT_PING       0x02u
#define CE_TIMER_EVT_LED        0x04u
#define CE_TIMER_EVT_CAPTURE_WD 0x08u
#define CE_TIMER_EVT_MASK       0x0Fu

#ifndef PSOC_SUPERMAQUINA_OWNS_DMA_IRQ
#define PSOC_SUPERMAQUINA_OWNS_DMA_IRQ 1u
#endif

#ifndef PSOC_SUPERMAQUINA_OWNS_SYNC_IRQ
#define PSOC_SUPERMAQUINA_OWNS_SYNC_IRQ 1u
#endif

#define CE_STATE_IDLE        0u
#define CE_STATE_ARMED       1u
#define CE_STATE_SAMPLING    2u
#define CE_STATE_DONE        3u
#define CE_STATE_ERROR       4u

static          uint8 g_ce_ctrl_level = 0u;
static          uint8 g_ce_cfg_level  = (CE_CFG_SRC_RAW | CE_CFG_IRQ_SYNC_EN | CE_CFG_IRQ_ERROR_EN);
static volatile uint8 g_ce_status     = CE_STATUS_IDLE;
static volatile uint8 g_ce_error      = 0u;
static volatile uint8 g_ce_state      = CE_STATE_IDLE;

/* -------------------------------------------------------------------------- */

static const uint8 g_ping_frame[4] = {
    0xABu, PSOC_CMD_PING, 0x00u, PSOC_CMD_PING
};

static void uart_send_ping(void)
{
    UART_PutArray(g_ping_frame, (uint8)sizeof(g_ping_frame));
}

static void uart_send_cfg_ack(uint8 cmd, uint8 val)
{
    uint8 frame[5u];
    frame[0] = 0xABu;
    frame[1] = PSOC_CMD_CFG_ACK;
    frame[2] = cmd;
    frame[3] = val;
    frame[4] = (uint8)(PSOC_CMD_CFG_ACK ^ cmd ^ val);
    UART_PutArray(frame, (uint8)sizeof(frame));
}

static void uart_wait_tx_complete_quiet(void)
{
    uint16 guard = 60000u;
    while (guard-- != 0u) {
#if (UART_TX_INTERRUPT_ENABLED && UART_TX_ENABLED)
        if (UART_GetTxBufferSize() != 0u) {
            continue;
        }
#endif
        if ((UART_ReadTxStatus() & UART_TX_STS_COMPLETE) != 0u) {
            break;
        }
    }
}

static void uart_send_fs_report(void)
{
    uint16 fs = psoc_adc_effective_fs_hz();
    uint8 fs_lo = (uint8)(fs & 0xFFu);
    uint8 fs_hi = (uint8)((fs >> 8u) & 0xFFu);
    uint8 frame[5u];
    frame[0] = 0xABu;
    frame[1] = PSOC_CMD_FS_REPORT;
    frame[2] = fs_lo;
    frame[3] = fs_hi;
    frame[4] = (uint8)(PSOC_CMD_FS_REPORT ^ fs_lo ^ fs_hi);
    UART_PutArray(frame, (uint8)sizeof(frame));
}

static void uart_send_diag(uint8 event, uint8 value)
{
#if PSOC_DIAG_ENABLE
    uint8 state = g_state;
    uint8 frame[6u];
    frame[0] = 0xABu;
    frame[1] = PSOC_CMD_DIAG_EVT;
    frame[2] = event;
    frame[3] = value;
    frame[4] = state;
    frame[5] = (uint8)(PSOC_CMD_DIAG_EVT ^ event ^ value ^ state);
    UART_PutArray(frame, (uint8)sizeof(frame));
    psoc_debug_print_evt(event, value, state);
#else
    (void)event;
    (void)value;
#endif
}

