simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
static uint8 diag_u16_sat(uint16 value)
{
    return (value > 255u) ? 255u : (uint8)value;
}

/* Tope del buffer de RAM del PSoC en lotes DECIMADOS. El contador de hardware
 * sigue limitado a 512 lotes CRUDOS por corrida; si el tiempo pedido necesita
 * mas, service_runtime() rearma superMaquina en trozos sin resetear este buffer. */
static uint16 capture_target_batches(void)
{
    uint16 n = g_n_batches;
    uint16 max_batches = PSOC_CAPTURE_MAX_BATCHES;
    if (g_sd_cap_en && sd_spi_present()) {
        max_batches = PSOC_SD_MAX_BATCHES;
    }
    if (n == 0u) {
        n = PSOC_CAPTURE_MAX_BATCHES;
    } else if (n > max_batches) {
        n = max_batches;
    }
    return n;
}

static uint8 capture_dump_pending(void)
{
    return (g_batches_sent < g_batches_captured) ? 1u : 0u;
}

static uint16 capture_stored_batches(void)
{
    if (g_sd_cap_active) {
        uint32 b = g_sd_ring_samples / (uint32)BATCH_SAMPLES;
        return (b > 0xFFFFu) ? 0xFFFFu : (uint16)b;
    }
    return (uint16)(((uint32)(g_capture_wr - g_capture_raw)) / CAPTURE_BATCH_BYTES);
}

static uint32 capture_written_samples(void)
{
    if (g_sd_cap_active) {
        return g_sd_ring_samples;
    }
    return ((uint32)(g_capture_wr - g_capture_raw)) / SAMPLE_BYTES;
}

static uint8 capture_target_samples_reached(void)
{
    return (capture_written_samples() >=
            ((uint32)g_total_target * (uint32)BATCH_SAMPLES)) ? 1u : 0u;
}

static uint16 capture_next_hw_target(uint16 target_batches, uint16 decim, uint16 hw_extra)
{
    uint32 target_samples;
    uint32 written_samples;
    uint32 remaining_decim_samples;
    uint32 raw_samples_needed;
    uint32 raw_batches_needed;
    uint32 target;

    if (target_batches == 0u) {
        return 1u;
    }
    if (decim == 0u) {
        decim = 1u;
    }

    target_samples = (uint32)target_batches * (uint32)BATCH_SAMPLES;
    written_samples = capture_written_samples();
    if (written_samples >= target_samples) {
        return 1u;
    }

    remaining_decim_samples = target_samples - written_samples;
    raw_samples_needed = remaining_decim_samples * (uint32)decim;
    if ((uint32)g_decim_n < raw_samples_needed) {
        raw_samples_needed -= (uint32)g_decim_n;
    } else {
        raw_samples_needed = 1u;
    }

    raw_batches_needed =
        (raw_samples_needed + (uint32)BATCH_SAMPLES - 1u) / (uint32)BATCH_SAMPLES;
    target = raw_batches_needed + (uint32)hw_extra;
    if (target > (uint32)PSOC_CAPTURE_MAX_BATCHES) {
        target = (uint32)PSOC_CAPTURE_MAX_BATCHES;
    }
    if (target == 0u) {
        target = 1u;
    }
    return (uint16)target;
}

/* ── Helpers de captura a SD (corren SOLO en main loop, nunca en ISR) ────── */

static void sd_put_le32(uint8 *p, uint32 v)
{
    p[0] = (uint8)v;
    p[1] = (uint8)(v >> 8u);
    p[2] = (uint8)(v >> 16u);
    p[3] = (uint8)(v >> 24u);
}

static uint32 sd_get_le32(const uint8 *p)
{
    return (uint32)p[0] | ((uint32)p[1] << 8u) |
           ((uint32)p[2] << 16u) | ((uint32)p[3] << 24u);
}

/* Lee el bloque directorio y reserva el arranque de la próxima sesión.
 * Directorio virgen/corrupto se re-inicializa (la SD es de uso exclusivo).
 * Devuelve 1 si la sesión quedó lista para escribir. */
static uint8 sd_session_begin(void)
{
    uint32 next_lba;

    if (!sd_spi_read_block(SD_CAPTURE_DIR_LBA, g_sd_blk)) {
        return 0u;
    }
    if ((g_sd_blk[0] == (uint8)'G') && (g_sd_blk[1] == (uint8)'D') &&
        (g_sd_blk[2] == (uint8)'I') && (g_sd_blk[3] == (uint8)'R')) {
        next_lba = sd_get_le32(&g_sd_blk[4]);
        if (next_lba < SD_CAPTURE_DATA_LBA) {
            next_lba = SD_CAPTURE_DATA_LBA;
        }
    } else {
        next_lba = SD_CAPTURE_DATA_LBA;
    }
    g_sd_session_lba = next_lba;
    return 1u;
}

/* Drena lotes decimados completos del ring hacia la SD. flush=1 al terminar la
 * captura: escribe también el bloque parcial que quede en staging. El buffer
 * ring mide un múltiplo exacto de lotes (512×90 B), así que un lote nunca se
 * parte en el wrap. */
static void sd_capture_drain(uint8 flush)
{
    for (;;) {
        uint32 avail_samples = g_sd_ring_samples - g_sd_ring_drained;
        const volatile uint8 *src;
        uint16 i;

        if (avail_samples < (uint32)BATCH_SAMPLES) {
            break;
        }
        src = g_capture_raw +
              ((g_sd_ring_drained % SD_RING_SAMPLES) * (uint32)SAMPLE_BYTES);
        for (i = 0u; i < CAPTURE_BATCH_BYTES; i++) {
            g_sd_blk[g_sd_blk_fill + i] = src[i];
        }
        g_sd_blk_fill += CAPTURE_BATCH_BYTES;
        g_sd_ring_drained += (uint32)BATCH_SAMPLES;

        if (g_sd_blk_fill >= (uint16)(SD_BATCHES_PER_BLOCK * CAPTURE_BATCH_BYTES)) {
            for (i = g_sd_blk_fill; i < SD_BLOCK_BYTES; i++) {
                g_sd_blk[i] = 0u;
            }
            if (!sd_spi_write_block(g_sd_session_lba + 1u + g_sd_blocks_written,
                                    g_sd_blk)) {
                g_sd_err_flags |= 0x01u;
            }
            g_sd_blocks_written++;
            g_sd_blk_fill = 0u;
        }
    }

    if (flush && (g_sd_blk_fill != 0u)) {
        uint16 i;
        for (i = g_sd_blk_fill; i < SD_BLOCK_BYTES; i++) {
            g_sd_blk[i] = 0u;
        }
        if (!sd_spi_write_block(g_sd_session_lba + 1u + g_sd_blocks_written,
                                g_sd_blk)) {
            g_sd_err_flags |= 0x01u;
        }
        g_sd_blocks_written++;
        g_sd_blk_fill = 0u;
    }
}

/* Header de sesión + actualización del directorio al terminar la captura.
 * Deja la sesión persistida en la SD (respaldo de campo) además del dump UART. */
static void sd_session_finalize(uint16 batches_captured)
{
    uint32 session_count = 0u;
    uint16 i;

    if (sd_spi_read_block(SD_CAPTURE_DIR_LBA, g_sd_blk) &&
        (g_sd_blk[0] == (uint8)'G') && (g_sd_blk[1] == (uint8)'D') &&
        (g_sd_blk[2] == (uint8)'I') && (g_sd_blk[3] == (uint8)'R')) {
        session_count = sd_get_le32(&g_sd_blk[8]);
    }

    for (i = 0u; i < SD_BLOCK_BYTES; i++) {
        g_sd_blk[i] = 0u;
    }
    g_sd_blk[0] = (uint8)'G'; g_sd_blk[1] = (uint8)'S';
    g_sd_blk[2] = (uint8)'E'; g_sd_blk[3] = (uint8)'S';
    sd_put_le32(&g_sd_blk[4], session_count);
    sd_put_le32(&g_sd_blk[8], (uint32)batches_captured);
    g_sd_blk[12] = (uint8)(psoc_adc_effective_fs_hz() & 0xFFu);
    g_sd_blk[13] = (uint8)((psoc_adc_effective_fs_hz() >> 8u) & 0xFFu);
    g_sd_blk[14] = psoc_adc_get_decimation();
    g_sd_blk[15] = g_stream_mode;
    g_sd_blk[16] = (uint8)SD_BATCHES_PER_BLOCK;
    g_sd_blk[17] = (uint8)BATCH_SAMPLES;
    if (!sd_spi_write_block(g_sd_session_lba, g_sd_blk)) {
        g_sd_err_flags |= 0x04u;
    }

    for (i = 0u; i < SD_BLOCK_BYTES; i++) {
        g_sd_blk[i] = 0u;
    }
    g_sd_blk[0] = (uint8)'G'; g_sd_blk[1] = (uint8)'D';
    g_sd_blk[2] = (uint8)'I'; g_sd_blk[3] = (uint8)'R';
    sd_put_le32(&g_sd_blk[4], g_sd_session_lba + 1u + g_sd_blocks_written);
    sd_put_le32(&g_sd_blk[8], session_count + 1u);
    if (!sd_spi_write_block(SD_CAPTURE_DIR_LBA, g_sd_blk)) {
        g_sd_err_flags |= 0x04u;
    }
    /* El staging queda libre: el dump lo reusa como caché de lectura. */
    g_sd_dump_blk_cached = 0xFFFFFFFFu;

    if (g_sd_drop_samples != 0u) {
        g_sd_err_flags |= 0x02u;
    }
    uart_send_diag(PSOC_EVT_SD_SESSION,
                   (g_sd_blocks_written > 255u) ? 255u : (uint8)g_sd_blocks_written);
    if (g_sd_err_flags != 0u) {
        uart_send_diag(PSOC_EVT_SD_ERROR, g_sd_err_flags);
    }
}

