simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
static void capture_engine_refresh_status(void)
{
    g_ce_status = status_Read();
    g_ce_error  = error_Read();
    g_ce_state  = state_Read();
}

static void capture_engine_write_ctrl(void)
{
    ctrl_Write(g_ce_ctrl_level);
}

static void capture_engine_pulse(uint8 pulse)
{
    ctrl_Write((uint8)(g_ce_ctrl_level | pulse));
    ctrl_Write(g_ce_ctrl_level);
}

static void capture_engine_set_source(uint8 source)
{
    g_ce_cfg_level = (uint8)((g_ce_cfg_level &
                              (uint8)~CE_CFG_SRC_MASK) |
                             (source & CE_CFG_SRC_MASK) |
                             CE_CFG_IRQ_SYNC_EN |
                             CE_CFG_IRQ_ERROR_EN);
    cfg_Write(g_ce_cfg_level);
}

static void capture_engine_set_enabled(uint8 enabled, uint8 use_sync)
{
    if (enabled) {
        g_ce_ctrl_level |= CE_CTRL_ENGINE_EN;
    } else {
        g_ce_ctrl_level &= (uint8)~CE_CTRL_ENGINE_EN;
    }

    if (use_sync) {
        g_ce_ctrl_level |= CE_CTRL_USE_SYNC;
    } else {
        g_ce_ctrl_level &= (uint8)~CE_CTRL_USE_SYNC;
    }

    capture_engine_write_ctrl();
}

static void capture_engine_reset_hw(void)
{
    reset_Write(1u);
    reset_Write(0u);
    g_timer_event_pending = 0u;
    capture_engine_refresh_status();
}

static void capture_engine_clear_flags(void)
{
    capture_engine_pulse(CE_CTRL_CLEAR_FLAGS);
    capture_engine_refresh_status();
}

static void timer_events_accumulate(uint8 events)
{
    uint8 saved;
    events &= CE_TIMER_EVT_MASK;
    if (events == 0u) {
        return;
    }
    saved = CyEnterCriticalSection();
    g_timer_event_pending |= events;
    CyExitCriticalSection(saved);
}

/* Toma solo los eventos incluidos en mask; el resto queda holdeado en
 * g_timer_event_pending hasta que un estado tranquilo los consuma. */
static uint8 timer_events_take_pending(uint8 mask)
{
    uint8 events;
    uint8 saved = CyEnterCriticalSection();
    events = (uint8)(g_timer_event_pending & mask & CE_TIMER_EVT_MASK);
    g_timer_event_pending &= (uint8)~events;
    CyExitCriticalSection(saved);
    return events;
}

/* Los TC ya no generan IRQ (política determinismo-primero): cada TC queda
 * retenido en el STATUS_TC de su timer fixed hasta que el lazo principal lo
 * lea acá. Durante ARMED/SAMPLING solo se sondea el watchdog de captura. */
static uint8 capture_engine_poll_capture_wd(void)
{
    uint8 events = 0u;

    if ((Timer_3_ReadStatusRegister() & Timer_3_STATUS_TC) != 0u) {
        Timer_3_Stop();
        events |= CE_TIMER_EVT_CAPTURE_WD;
    }
    if (events != 0u) {
        timer_events_accumulate(events);
    }
    return events;
}

static uint8 capture_engine_poll_timer_events(void)
{
    uint8 events = 0u;

    if ((Timer_ReadStatusRegister() & Timer_STATUS_TC) != 0u) {
        Timer_Stop();
        events |= CE_TIMER_EVT_UART;
    }
    if ((Timer_1_ReadStatusRegister() & Timer_1_STATUS_TC) != 0u) {
        Timer_1_Stop();
        events |= CE_TIMER_EVT_PING;
    }
    if ((Timer_2_ReadStatusRegister() & Timer_2_STATUS_TC) != 0u) {
        Timer_2_Stop();
        events |= CE_TIMER_EVT_LED;
    }
    if (events != 0u) {
        timer_events_accumulate(events);
    }
    events |= capture_engine_poll_capture_wd();
    return events;
}

/* Carga el objetivo de lotes en superMaquina. Para FIR armado el caller pasa
 * un objetivo extendido: el ARM descarta FILTER_GROUP_DELAY muestras y aun asi
 * quedan los lotes pedidos en el buffer final. */
static void capture_engine_configure_target(uint16 hw_target)
{
    uint16 limit = (uint16)(hw_target - 1u);
    uint8 saved_cfg = g_ce_cfg_level;

    cfg_Write((uint8)(limit & 0xFFu));
    capture_engine_pulse(CE_CTRL_LOAD_BATCH_LO);
    cfg_Write((uint8)((limit >> 8u) & 0x01u));
    capture_engine_pulse(CE_CTRL_LOAD_BATCH_HI);
    cfg_Write(saved_cfg);
}

static uint8 capture_engine_source_from_stream(uint8 use_filter)
{
#if PSOC_RAMP_DEBUG_ENABLE
    if (g_debug_psoc) {
        return CE_CFG_SRC_DEBUG;
    }
#endif
    return (use_filter != 0u) ? CE_CFG_SRC_FILTER : CE_CFG_SRC_RAW;
}

static void psoc_prepare_capture_path(void)
{
    psoc_calibration_servo_abort();
    ADC_StopConvert();
    psoc_adc_select_capture_config();
    psoc_calibration_restore_capture_path();
}

static uint32 timer_ms_to_counts(uint32 ms)
{
    uint32 counts = ms * (uint32)TIMER_ILO_COUNTS_PER_MS;
    return (counts == 0u) ? 1u : counts;
}

static uint16 timer_take_chunk(volatile uint32 *remaining_counts)
{
    uint32 remaining = *remaining_counts;
    uint16 chunk;

    if (remaining == 0u) {
        return 0u;
    }
    if (remaining > TIMER_MAX_COUNTS) {
        chunk = (uint16)TIMER_MAX_COUNTS;
        *remaining_counts = remaining - TIMER_MAX_COUNTS;
    } else {
        chunk = (uint16)remaining;
        *remaining_counts = 0u;
    }
    return chunk;
}

static void timer1_start_next_chunk(void)
{
    uint16 chunk = timer_take_chunk(&g_timer1_remaining_counts);
    if (chunk == 0u) { return; }
    Timer_1_Stop();
    Timer_1_WritePeriod(chunk);
    Timer_1_WriteCounter(chunk);
    (void)Timer_1_ReadStatusRegister();
    isr_Timer_1_ClearPending();
    Timer_1_Start();
}

static void timer1_arm_ms(uint32 ms, uint8 mode)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_1_Stop();
    g_timer1_mode = mode;
    g_timer1_remaining_counts = timer_ms_to_counts(ms);
    timer1_start_next_chunk();
    CyExitCriticalSection(saved);
}

static void timer1_stop_quiet(void)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_1_Stop();
    (void)Timer_1_ReadStatusRegister();
    isr_Timer_1_ClearPending();
    g_timer1_remaining_counts = 0u;
    g_timer1_mode = TIMER1_MODE_NONE;
    CyExitCriticalSection(saved);
}

static void timer2_start_next_chunk(void)
{
    uint16 chunk = timer_take_chunk(&g_timer2_remaining_counts);
    if (chunk == 0u) { return; }
    Timer_2_Stop();
    Timer_2_WritePeriod(chunk);
    Timer_2_WriteCounter(chunk);
    (void)Timer_2_ReadStatusRegister();
    isr_Timer_2_ClearPending();
    Timer_2_Start();
}

static void timer2_arm_ms(uint32 ms, uint8 mode)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_2_Stop();
    g_timer2_mode = mode;
    g_timer2_remaining_counts = timer_ms_to_counts(ms);
    timer2_start_next_chunk();
    CyExitCriticalSection(saved);
}

static void timer2_stop_quiet(void)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_2_Stop();
    (void)Timer_2_ReadStatusRegister();
    isr_Timer_2_ClearPending();
    g_timer2_remaining_counts = 0u;
    g_timer2_mode = TIMER2_MODE_NONE;
    CyExitCriticalSection(saved);
}

static void timer3_start_next_chunk(void)
{
    uint16 chunk = timer_take_chunk(&g_timer3_remaining_counts);
    if (chunk == 0u) { return; }
    Timer_3_Stop();
    Timer_3_WritePeriod(chunk);
    Timer_3_WriteCounter(chunk);
    (void)Timer_3_ReadStatusRegister();
    isr_Timer_3_ClearPending();
    Timer_3_Start();
}

static void timer3_arm_ms(uint32 ms)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_3_Stop();
    g_timer3_remaining_counts = timer_ms_to_counts(ms);
    timer3_start_next_chunk();
    CyExitCriticalSection(saved);
}

