simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
static void timer3_stop_quiet(void)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_3_Stop();
    (void)Timer_3_ReadStatusRegister();
    isr_Timer_3_ClearPending();
    g_timer3_remaining_counts = 0u;
    CyExitCriticalSection(saved);
}

static void fixed_timers_init(void)
{
    Timer_Init();   Timer_initVar = 1u;   Timer_Stop();   (void)Timer_ReadStatusRegister();
    Timer_1_Init(); Timer_1_initVar = 1u; Timer_1_Stop(); (void)Timer_1_ReadStatusRegister();
    Timer_2_Init(); Timer_2_initVar = 1u; Timer_2_Stop(); (void)Timer_2_ReadStatusRegister();
    Timer_3_Init(); Timer_3_initVar = 1u; Timer_3_Stop(); (void)Timer_3_ReadStatusRegister();
    isr_Timer_SetPriority(7u);
    isr_Timer_1_SetPriority(7u);
    isr_Timer_2_SetPriority(7u);
    isr_Timer_3_SetPriority(7u);
    isr_Timer_Disable();
    isr_Timer_1_Disable();
    isr_Timer_2_Disable();
    isr_Timer_3_Disable();
    isr_Timer_ClearPending();
    isr_Timer_1_ClearPending();
    isr_Timer_2_ClearPending();
    isr_Timer_3_ClearPending();
}

static void rx_watchdog_start(void)
{
    uint8 saved = CyEnterCriticalSection();
    watchdog_rx = 0u;
    Timer_Stop();
    Timer_WritePeriod((uint16)TIMEOUT_COUNTS);
    Timer_WriteCounter((uint16)TIMEOUT_COUNTS);
    (void)Timer_ReadStatusRegister();
    isr_Timer_ClearPending();
    Timer_Start();
    CyExitCriticalSection(saved);
}

static void rx_watchdog_stop(void)
{
    uint8 saved = CyEnterCriticalSection();
    Timer_Stop();
    (void)Timer_ReadStatusRegister();
    isr_Timer_ClearPending();
    watchdog_rx = 0u;
    CyExitCriticalSection(saved);
}

static void idle_ping_schedule(void)
{
    g_idle_ping_due = 0u;
    g_idle_ping_armed = 1u;
    timer1_arm_ms(IDLE_PING_MS, TIMER1_MODE_IDLE_PING);
}

static void idle_ping_stop(void)
{
    if (g_timer1_mode == TIMER1_MODE_IDLE_PING) {
        timer1_stop_quiet();
    }
    g_idle_ping_due = 0u;
    g_idle_ping_armed = 0u;
}

static void comm_led_stop(void)
{
    if (g_timer2_mode == TIMER2_MODE_COMM_BLINK) {
        timer2_stop_quiet();
    }
    g_comm_led_active = 0u;
    g_comm_blink_due = 0u;
    g_comm_blinks_remaining = 0u;
}

/* ── Watchdog de captura (Timer_3, dedicado) ──
 * Si superMaquina nunca llega a DONE (p.ej. ADC detenido, DMA sin disparos),
 * el equipo antes quedaba mudo para siempre. Ahora el ARM se despierta al
 * vencer la duracion nominal + margen y aborta con diagnostico. Al tener
 * timer propio no compite con LED/esperas de Timer_2. */
static uint32 capture_expected_ms(uint16 batches)
{
    /* `batches` son lotes DECIMADOS (almacenados); psoc_adc_effective_fs_hz()
     * ya refleja 2929/factor, así que esta cuenta da el tiempo real de pared
     * de la corrida sin tener que multiplicar por el factor a mano acá.
     * A 2929 S/s sin decimar: 30 muestras/lote ≈ 10.24 ms/lote. */
    return ((uint32)batches * (uint32)BATCH_SAMPLES * 1000u) /
           (uint32)psoc_adc_effective_fs_hz();
}

static void capture_watchdog_arm(void)
{
    uint32 ms = capture_expected_ms(capture_target_batches());
    g_capture_wd_due = 0u;
    timer3_arm_ms(ms + (ms >> 1u) + CAPTURE_WD_MARGIN_MS);
}

static void capture_watchdog_stop(void)
{
    timer3_stop_quiet();
    g_capture_wd_due = 0u;
}

static void runtime_timers_stop_for_quiet_window(void)
{
    rx_watchdog_stop();
    idle_ping_stop();
    comm_led_stop();
}

/* Tick de calibracion sobre Timer_1: progreso periodico + watchdog global.
 * Nunca concurre con los pings (los callers detienen idle/boot ping antes). */
void psoc_cal_timer_start(uint32 progress_ms, uint32 watchdog_ms)
{
    uint8 saved = CyEnterCriticalSection();
    if (progress_ms == 0u) { progress_ms = 1u; }
    if (watchdog_ms == 0u) { watchdog_ms = progress_ms; }
    g_cal_progress_due = 0u;
    g_cal_watchdog_due = 0u;
    g_cal_progress_period_ms = progress_ms;
    g_cal_watchdog_remaining_ms = watchdog_ms;
    g_cal_timer_active = 1u;
    g_idle_ping_due = 0u;
    g_idle_ping_armed = 0u;
    g_boot_ping_due = 0u;
    timer1_arm_ms(progress_ms, TIMER1_MODE_CAL_TICK);
    CyExitCriticalSection(saved);
}

void psoc_cal_timer_stop(void)
{
    uint8 saved = CyEnterCriticalSection();
    g_cal_timer_active = 0u;
    g_cal_progress_due = 0u;
    g_cal_watchdog_due = 0u;
    g_cal_progress_period_ms = 0u;
    g_cal_watchdog_remaining_ms = 0u;
    if (g_timer1_mode == TIMER1_MODE_CAL_TICK) {
        timer1_stop_quiet();
    }
    CyExitCriticalSection(saved);
}

uint8 psoc_cal_timer_take_progress_due(void)
{
    uint8 due;
    uint8 saved = CyEnterCriticalSection();
    due = g_cal_progress_due;
    g_cal_progress_due = 0u;
    CyExitCriticalSection(saved);
    return due;
}

uint8 psoc_cal_timer_take_watchdog_due(void)
{
    uint8 due;
    uint8 saved = CyEnterCriticalSection();
    due = g_cal_watchdog_due;
    g_cal_watchdog_due = 0u;
    CyExitCriticalSection(saved);
    return due;
}

static void capture_reset_locked(uint16 stored_batches)
{
    g_batches_sent     = 0u;
    g_batches_captured = 0u;
    g_capture_done     = 0u;
    g_capture_wd_due   = 0u;
    g_dbg_cnt          = 0u;
    g_seq              = 0u;
    g_fir_discard      = 0u;
    g_decim_acc        = 0;
    g_decim_n          = 0u;
    g_capture_wr       = g_capture_raw;
    g_capture_end      = g_capture_raw + ((uint32)stored_batches * CAPTURE_BATCH_BYTES);
    /* Estado de captura a SD: siempre se limpia; psoc_arm() re-activa
     * g_sd_cap_active después de este reset si corresponde. Así cualquier
     * camino de stop/abort deja el modo SD desarmado. */
    g_sd_cap_active     = 0u;
    g_sd_ring_samples   = 0u;
    g_sd_ring_drained   = 0u;
    g_sd_target_samples = 0u;
    g_sd_drop_samples   = 0u;
    g_sd_blk_fill       = 0u;
    g_sd_blocks_written = 0u;
    g_sd_dump_blk_cached = 0xFFFFFFFFu;
    g_sd_err_flags      = 0u;
}

static int32 sign_extend_bits(uint32 value, uint8 bits)
{
    uint32 sign;
    uint32 mask;

    if (bits == 0u || bits >= 32u) {
        return (int32)value;
    }
    sign = (uint32)1u << (bits - 1u);
    mask = (sign << 1u) - 1u;
    value &= mask;
    return (value & sign) ? (int32)(value | ~mask) : (int32)value;
}

/* Reconstruye int32 signed a partir de una palabra DMA LE de 24 bits. */
static int32 dma_buf_to_i24(const volatile uint8 *buf)
{
    uint32 u = (uint32)buf[0] | ((uint32)buf[1] << 8u) | ((uint32)buf[2] << 16u);
    return sign_extend_bits(u, 24u);
}

/* El ADC raw puede venir right-aligned (configs 2/3/4: CF_0V512, CF_1V024,
 * CF_0V625), donde el bit de signo real es resolution-1. Solo CF_2V5 es
 * left-aligned (Bit-23 OVF Protected) y ya viene sign-extendido en 24 bits.
 * La salida del DFB sigue usando dma_buf_to_i24(). */
static int32 dma_buf_to_adc_counts(const volatile uint8 *buf)
{
    uint32 u = (uint32)buf[0] | ((uint32)buf[1] << 8u) | ((uint32)buf[2] << 16u);

#if (ADC_DEFAULT_NUM_CONFIGS > 1)
#if (ADC_CF_0V512_ALIGNMENT == 0u)
    if (ADC_Config != ADC_CF_2V5) {
        return sign_extend_bits(u, (uint8)ADC_CF_0V512_RESOLUTION);
    }
#endif
#endif

    return sign_extend_bits(u, 24u);
}

/* ── Handlers de muestra de superMaquina ─────────────────────────────────────
 * El IRQ único de superMaquina llega una vez por muestra aceptada. Para no
 * decidir el modo en cada interrupción, el trabajo por muestra se resuelve
 * con un puntero a función que se fija al cambiar de modo:
 *   captura raw/filtrada : copiar 3 bytes crudos al puntero de escritura
 *                          (el alineado se difiere al volcado UART).
 *   captura debug        : rampa sintética paceada por el ADC real.
 *   bypass calibración   : alinear y publicar la muestra para calibration.c.
 *   armed-wait           : primer IRQ tras el sync — bookkeeping de la
 *                          transición ARMED→SAMPLING y cambio al handler de
 *                          captura elegido al armar.
 */
typedef void (*sm_sample_handler_t)(void);

