simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
static void sm_sample_noop(void)
{
}

/* Empaqueta un valor ya decodificado/promediado de vuelta en 3 bytes LE
 * (mismo formato que la palabra cruda del DMA, 24 bits). El volcado UART
 * (uart_send_capture_batch) lo vuelve a decodificar con
 * dma_buf_to_adc_counts()/dma_buf_to_i24() exactamente igual que una
 * muestra sin decimar — round-trip transparente, sin tocar esa ruta. */
static void capture_store_decoded(volatile uint8 *dst, int32 val)
{
    dst[0] = (uint8)( val         & 0xFFu);
    dst[1] = (uint8)((val >>  8u) & 0xFFu);
    dst[2] = (uint8)((val >> 16u) & 0xFFu);
}

static void sm_sample_capture_raw(void)
{
    volatile uint8 *dst = g_capture_wr;
    int32 val;
    if (dst >= g_capture_end) { return; }
    val = dma_buf_to_adc_counts(g_dma_raw_buf);
    g_decim_acc += val;
    g_decim_n++;
    if (g_decim_n < g_capture_decim_factor) { return; }
    val = g_decim_acc / (int32)g_capture_decim_factor;
    g_decim_acc = 0;
    g_decim_n = 0u;
    capture_store_decoded(dst, val);
    dst += SAMPLE_BYTES;
    g_capture_wr = dst;
    if (dst >= g_capture_end) { g_capture_done = 1u; }
}

static void sm_sample_capture_filt(void)
{
    volatile uint8 *dst = g_capture_wr;
    int32 val;
    if (g_fir_discard != 0u) {
        g_fir_discard--;
        return;
    }
    if (dst >= g_capture_end) { return; }
    val = dma_buf_to_i24(g_dma_filt_buf);
    g_decim_acc += val;
    g_decim_n++;
    if (g_decim_n < g_capture_decim_factor) { return; }
    val = g_decim_acc / (int32)g_capture_decim_factor;
    g_decim_acc = 0;
    g_decim_n = 0u;
    capture_store_decoded(dst, val);
    dst += SAMPLE_BYTES;
    g_capture_wr = dst;
    if (dst >= g_capture_end) { g_capture_done = 1u; }
}

/* Variantes ring para captura a SD: mismos decode/decimación que las
 * versiones RAM-only, pero escriben por contador monotónico con wrap y
 * detección de overrun en vez de puntero lineal. Instaladas SOLO cuando
 * g_sd_cap_active=1 — las versiones clásicas quedan intactas. */
static void sd_ring_store(int32 val)
{
    volatile uint8 *dst;
    uint32 written = g_sd_ring_samples;

    if (written >= g_sd_target_samples) {
        return;
    }
    if ((written - g_sd_ring_drained) >= SD_RING_SAMPLES) {
        /* Ring lleno: la SD no drenó a tiempo. Se descarta la muestra y se
         * reporta al final (PSOC_EVT_SD_ERROR bit1). */
        g_sd_drop_samples++;
        return;
    }
    dst = g_capture_raw + ((written % SD_RING_SAMPLES) * (uint32)SAMPLE_BYTES);
    capture_store_decoded(dst, val);
    written++;
    g_sd_ring_samples = written;
    if (written >= g_sd_target_samples) {
        g_capture_done = 1u;
    }
}

static void sm_sample_capture_raw_sd(void)
{
    int32 val = dma_buf_to_adc_counts(g_dma_raw_buf);
    g_decim_acc += val;
    g_decim_n++;
    if (g_decim_n < g_capture_decim_factor) {
        return;
    }
    val = g_decim_acc / (int32)g_capture_decim_factor;
    g_decim_acc = 0;
    g_decim_n = 0u;
    sd_ring_store(val);
}

static void sm_sample_capture_filt_sd(void)
{
    int32 val;
    if (g_fir_discard != 0u) {
        g_fir_discard--;
        return;
    }
    val = dma_buf_to_i24(g_dma_filt_buf);
    g_decim_acc += val;
    g_decim_n++;
    if (g_decim_n < g_capture_decim_factor) {
        return;
    }
    val = g_decim_acc / (int32)g_capture_decim_factor;
    g_decim_acc = 0;
    g_decim_n = 0u;
    sd_ring_store(val);
}

#if PSOC_RAMP_DEBUG_ENABLE
static void sm_sample_capture_debug(void)
{
    volatile uint8 *dst = g_capture_wr;
    uint32 val;
    if (dst >= g_capture_end) { return; }
    val = g_dbg_cnt++ & 0x00FFFFFFu;
    dst[0] = (uint8)( val         & 0xFFu);
    dst[1] = (uint8)((val >>  8u) & 0xFFu);
    dst[2] = (uint8)((val >> 16u) & 0xFFu);
    dst += SAMPLE_BYTES;
    g_capture_wr = dst;
    if (dst >= g_capture_end) { g_capture_done = 1u; }
}
#endif

static void sm_sample_cal_raw(void)
{
    psoc_adc_note_isr_sample(
        psoc_adc_counts_right_aligned(dma_buf_to_adc_counts(g_dma_raw_buf)));
}

static void sm_sample_cal_filt(void)
{
    psoc_adc_note_isr_filtered_sample(
        psoc_adc_counts_right_aligned(dma_buf_to_i24(g_dma_filt_buf)));
}

static volatile sm_sample_handler_t g_sm_sample_handler = sm_sample_noop;
/* Handler de captura elegido al armar; sm_sample_armed_wait lo instala al
 * detectar la transición ARMED→SAMPLING. */
static volatile sm_sample_handler_t g_sm_capture_handler = sm_sample_noop;

static sm_sample_handler_t capture_handler_for_source(uint8 source)
{
#if PSOC_RAMP_DEBUG_ENABLE
    if (source == CE_CFG_SRC_DEBUG) { return sm_sample_capture_debug; }
#endif
    if (source == CE_CFG_SRC_FILTER || source == CE_CFG_SRC_COMBINED) {
        return g_sd_cap_active ? sm_sample_capture_filt_sd : sm_sample_capture_filt;
    }
    return g_sd_cap_active ? sm_sample_capture_raw_sd : sm_sample_capture_raw;
}

static void sm_sample_armed_wait(void)
{
    /* Primer IRQ tras el sync (IRQ_SYNC_EN): superMaquina ya está muestreando.
     * No hay muestra que copiar todavía; solo bookkeeping de la ventana. */
    capture_watchdog_arm();
    g_state = PSOC_SAMPLING;
    g_sm_sample_handler = g_sm_capture_handler;
}

static void psoc_enter_sampling(uint8 debugMode)
{
    uint8 saved;
    uint8 source;
    uint16 decim = (uint16)psoc_adc_get_decimation();
    uint16 total_target = capture_target_batches();
    uint16 hw_target;

#if PSOC_RAMP_DEBUG_ENABLE
    if (debugMode) {
        /* La rampa debug no pasa por el acumulador de decimación — ver
         * mismo comentario en psoc_arm(). */
        decim = 1u;
    }
#endif
    ADC_StopConvert();
    runtime_timers_stop_for_quiet_window();
    saved = CyEnterCriticalSection();
#if PSOC_RAMP_DEBUG_ENABLE
    g_debug_psoc = debugMode ? 1u : 0u;
#else
    (void)debugMode;
    g_debug_psoc = 0u;
#endif
    capture_reset_locked(total_target);
    g_capture_decim_factor = (uint8)decim;
    g_total_target = total_target;
    g_total_sent   = 0u;
    g_chain_active = 0u;
    g_state = PSOC_SAMPLING;
    hw_target = capture_next_hw_target(total_target, decim, 0u);
    if ((uint32)total_target * (uint32)decim > (uint32)PSOC_CAPTURE_MAX_BATCHES) {
        g_chain_active = 1u;
    }
    CyExitCriticalSection(saved);
    source = capture_engine_source_from_stream(g_stream_mode);
#if PSOC_RAMP_DEBUG_ENABLE
    g_capture_align = (source == CE_CFG_SRC_DEBUG) ? 0u : 1u;
#else
    g_capture_align = 1u;
#endif
    g_capture_adc_raw = (source == CE_CFG_SRC_RAW) ? 1u : 0u;
    capture_engine_configure_target(hw_target);
    /* start-now: el FIR viene alimentado en bypass, historia caliente — sin
     * descarte de retardo de grupo. */
    capture_engine_set_source(source);
    g_sm_capture_handler = capture_handler_for_source(source);
    g_sm_sample_handler = g_sm_capture_handler;
    capture_engine_set_enabled(1u, 0u);
    capture_engine_clear_flags();
    capture_watchdog_arm();
    capture_engine_pulse(CE_CTRL_START_NOW);
    if (g_n_batches > PSOC_CAPTURE_MAX_BATCHES) {
        /* Pedido recortado al buffer RAM del PSoC. */
        uart_send_diag(PSOC_EVT_CAPTURE_CLAMPED, diag_u16_sat(g_n_batches));
    }
    uart_send_diag(PSOC_EVT_SAMPLING_START, diag_u16_sat(total_target));
    ADC_StartConvert();
}

static void service_timer_uart_tc(void)
{
    if (rx_state != 0u) {
        watchdog_rx = 1u;
    }
}

static void service_timer_ping_tc(void)
{
    if (g_timer1_remaining_counts != 0u) {
        timer1_start_next_chunk();
        return;
    }

    if (g_timer1_mode == TIMER1_MODE_BOOT_PING) {
        g_boot_ping_due = 1u;
        g_timer1_mode = TIMER1_MODE_NONE;
    } else if (g_timer1_mode == TIMER1_MODE_IDLE_PING) {
        g_idle_ping_due = 1u;
        g_idle_ping_armed = 0u;
        g_timer1_mode = TIMER1_MODE_NONE;
    } else if (g_timer1_mode == TIMER1_MODE_CAL_TICK) {
        g_timer1_mode = TIMER1_MODE_NONE;
        if (g_cal_timer_active) {
            g_cal_progress_due = 1u;
            if (g_cal_watchdog_remaining_ms <= g_cal_progress_period_ms) {
                g_cal_watchdog_remaining_ms = 0u;
                g_cal_watchdog_due = 1u;
                g_cal_timer_active = 0u;
            } else {
                g_cal_watchdog_remaining_ms -= g_cal_progress_period_ms;
                g_timer1_mode = TIMER1_MODE_CAL_TICK;
                g_timer1_remaining_counts = timer_ms_to_counts(g_cal_progress_period_ms);
                timer1_start_next_chunk();
            }
        }
    } else {
        g_timer1_mode = TIMER1_MODE_NONE;
    }
}

static void service_timer_led_tc(void)
{
    if (g_timer2_remaining_counts != 0u) {
        timer2_start_next_chunk();
        return;
    }

    if (g_timer2_mode == TIMER2_MODE_BOOT_LED_OFF) {
        g_boot_led_off_due = 1u;
    } else if (g_timer2_mode == TIMER2_MODE_WAIT) {
        g_timer2_wait_done = 1u;
    } else if (g_timer2_mode == TIMER2_MODE_COMM_BLINK) {
        g_comm_blink_due = 1u;
    }
    g_timer2_mode = TIMER2_MODE_NONE;
}

