simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
static void service_timer_capture_watchdog_tc(void)
{
    if (g_timer3_remaining_counts != 0u) {
        timer3_start_next_chunk();
        return;
    }
    g_capture_wd_due = 1u;
}

/* Despacha los eventos de timer permitidos por mask. Ya no pulsa CLEAR_FLAGS:
 * los TC no tienen sticky en superMaquina (y un CLEAR_FLAGS durante SAMPLING
 * resetearía los contadores de muestra/lote en pleno vuelo). */
static void service_timer_events(uint8 mask)
{
    uint8 events = timer_events_take_pending(mask);

    if ((events & CE_TIMER_EVT_UART) != 0u) {
        Timer_Stop();
        (void)Timer_ReadStatusRegister();
        service_timer_uart_tc();
    }
    if ((events & CE_TIMER_EVT_PING) != 0u) {
        Timer_1_Stop();
        (void)Timer_1_ReadStatusRegister();
        service_timer_ping_tc();
    }
    if ((events & CE_TIMER_EVT_LED) != 0u) {
        Timer_2_Stop();
        (void)Timer_2_ReadStatusRegister();
        service_timer_led_tc();
    }
    if ((events & CE_TIMER_EVT_CAPTURE_WD) != 0u) {
        Timer_3_Stop();
        (void)Timer_3_ReadStatusRegister();
        service_timer_capture_watchdog_tc();
    }
}

/* Fallbacks legacy (solo compilados con PSOC_SUPERMAQUINA_OWNS_DMA_IRQ=0,
 * TopDesign viejo con ISRs de DMA separadas): despachan al mismo handler. */
CY_ISR(isr_DMA_DelSig_RAM_Handler)
{
    g_sm_sample_handler();
}

CY_ISR(isr_DMA_Filter_RAM_Handler)
{
    g_sm_sample_handler();
}

CY_ISR(isr_Timer)
{
    uint8 st = Timer_ReadStatusRegister();
    Timer_Stop();
    if (st == 0u) {
        if (++g_t0_spurious >= TIMER_STORM_TRIP) {
            isr_Timer_Disable();
            g_timer_storm |= 0x01u;
            g_t0_spurious = 0u;
        }
        return;
    }
    g_t0_spurious = 0u;
    service_timer_uart_tc();
}

CY_ISR(isr_Timer_1)
{
    uint8 st = Timer_1_ReadStatusRegister();
    Timer_1_Stop();
    if (st == 0u) {
        if (++g_t1_spurious >= TIMER_STORM_TRIP) {
            isr_Timer_1_Disable();
            g_timer_storm |= 0x02u;
            g_t1_spurious = 0u;
        }
        return;
    }
    g_t1_spurious = 0u;
    service_timer_ping_tc();
}

CY_ISR(isr_Timer_2)
{
    uint8 st = Timer_2_ReadStatusRegister();
    Timer_2_Stop();
    if (st == 0u) {
        if (++g_t2_spurious >= TIMER_STORM_TRIP) {
            isr_Timer_2_Disable();
            g_timer_storm |= 0x04u;
            g_t2_spurious = 0u;
        }
        return;
    }
    g_t2_spurious = 0u;
    service_timer_led_tc();
}

CY_ISR(isr_Timer_3)
{
    uint8 st = Timer_3_ReadStatusRegister();
    Timer_3_Stop();
    if (st == 0u) {
        if (++g_t3_spurious >= TIMER_STORM_TRIP) {
            isr_Timer_3_Disable();
            g_timer_storm |= 0x08u;
            g_t3_spurious = 0u;
        }
        return;
    }
    g_t3_spurious = 0u;
    service_timer_capture_watchdog_tc();
}

CY_ISR(isr_SyncIn)
{
    uint8 saved;
#if defined(SYNC_IN_INTSTAT)
    (void)SYNC_IN_ClearInterrupt();
#endif
    if (SYNC_IN_Read())
    {
        uart_send_diag(PSOC_EVT_SYNC_RISE, g_state);
        if (g_state == PSOC_ARMED)
        {
            psoc_enter_sampling(g_debug_psoc);
        }
    }
    else
    {
        uart_send_diag(PSOC_EVT_SYNC_FALL, g_state);
        ADC_StopConvert();
        capture_watchdog_stop();
        idle_ping_schedule();
        saved = CyEnterCriticalSection();
        capture_reset_locked(capture_target_batches());
        g_chain_active = 0u;
        g_total_target = 0u;
        g_total_sent = 0u;
        g_state = PSOC_IDLE;
        CyExitCriticalSection(saved);
    }
}

/* IRQ único de superMaquina. Fast path: una sola lectura de status y el
 * handler de muestra vigente; el resto (fin de captura, error, botón) va por
 * el camino lento, que ocurre a lo sumo unas pocas veces por captura.
 * Los TC de timers ya no llegan acá: quedan holdeados en el STATUS_TC de su
 * timer y los consume el polling de service_runtime(). Así cada IRQ sin
 * DONE/ERROR/BUTTON es una muestra, sin ambigüedad ni lecturas extra. */
CY_ISR(isr_SuperMaquina_Handler)
{
    uint8 st = status_Read();

    if ((st & (CE_STATUS_DONE | CE_STATUS_ERROR | CE_STATUS_BUTTON)) == 0u)
    {
        g_sm_sample_handler();
        return;
    }

    g_ce_status = st;

#if PSOC_BUTTON_CAL_ENABLE
    if ((st & CE_STATUS_BUTTON) != 0u)
    {
        g_cal_button_pressed = 1u;
        capture_engine_clear_flags();
        if ((st & (CE_STATUS_DONE | CE_STATUS_ERROR)) == 0u)
        {
            /* El botón puede coincidir con una muestra de bypass (calibración
             * en curso): no perderla. */
            g_sm_sample_handler();
            return;
        }
    }
#endif

    if ((st & CE_STATUS_ERROR) != 0u)
    {
        g_ce_error = error_Read();
        g_sm_sample_handler = sm_sample_noop;
        if (g_state != PSOC_SAMPLING) {
            g_state = PSOC_SAMPLING;   /* canaliza el cierre por service_runtime */
        }
        g_capture_done = 1u;
        return;
    }

    if ((st & CE_STATUS_DONE) != 0u)
    {
        /* La última muestra del último lote llega junto con DONE. */
        g_sm_sample_handler();
        g_sm_sample_handler = sm_sample_noop;
        if (g_state == PSOC_ARMED) {
            g_state = PSOC_SAMPLING;
        }
        g_capture_done = 1u;
    }
}

CY_ISR(isr_Button_Handler)
{
#ifdef CY_ISR_isr_Button_H
    isr_Button_ClearPending();
#endif
#if PSOC_BUTTON_CAL_ENABLE
    g_cal_button_pressed = 1u;
#endif
}

/* ── Trampas de robustez ─────────────────────────────────────────────────────
 * 1) isr_SyncIn: calibration.c la deshabilita/rehabilita alrededor de una
 *    corrida (cal_async_complete). Con PSOC_SUPERMAQUINA_OWNS_SYNC_IRQ el
 *    vector nunca se instalaba, así que ese re-enable dejaba la NVIC apuntando
 *    a IntDefaultHandler (while(1)): el siguiente flanco de SYNC_IN congelaba
 *    el equipo. Se instala SIEMPRE un vector seguro.
 * 2) Cualquier IRQ que siga apuntando a IntDefaultHandler se re-vector a un
 *    trap que reporta el número de IRQ por UART (EVT 0x7E) y la deshabilita,
 *    en vez de colgar el firmware.
 * 3) HardFault (EVT 0x7F) queda en loop parpadeando el LED rápido. */
static void led_write(uint8 value);

CY_ISR(isr_SyncIn_SafeVector)
{
#if defined(SYNC_IN_INTSTAT)
    (void)SYNC_IN_ClearInterrupt();
#endif
}

extern void IntDefaultHandler(void);

#ifndef CY_NUM_INTERRUPTS
#define CY_NUM_INTERRUPTS 32u
#endif

CY_ISR(unexpected_irq_trap)
{
    uint32 vecactive = CY_GET_REG32((reg32 *)0xE000ED04u) & 0x1FFu;
    uint8 irq_n = (uint8)((vecactive >= 16u) ? (vecactive - 16u) : 0xFFu);
    if (irq_n < CY_NUM_INTERRUPTS) {
        CyIntDisable(irq_n);
    }
    uart_send_diag(0x7Eu, irq_n);
}

