simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
CY_ISR(hardfault_trap)
{
    uart_send_diag(0x7Fu, 0u);
    for (;;)
    {
        led_write(0u);
        CyDelay(60u);
        led_write(1u);
        CyDelay(60u);
    }
}

static void install_irq_traps(void)
{
    uint8 i;
    for (i = 0u; i < CY_NUM_INTERRUPTS; i++) {
        if (CyIntGetVector(i) == (cyisraddress)IntDefaultHandler) {
            (void)CyIntSetVector(i, unexpected_irq_trap);
        }
    }
    (void)CyIntSetSysVector(3u, hardfault_trap); /* HardFault */
}

static void led_write(uint8 value)
{
#ifdef CY_PINS_LED_H
    LED_Write(value);
#else
    (void)value;
#endif
}

static void led_toggle(void)
{
#ifdef CY_PINS_LED_H
    if (g_state != PSOC_ARMED && g_state != PSOC_SAMPLING) {
        LED_Write(LED_Read() ^ 0x01u);
    }
#endif
}

static void comm_led_start_identify(void)
{
    g_comm_led_active = 1u;
    g_comm_blinks_remaining = (uint16)IDENTIFY_BLINK_TOGGLES;
    g_comm_blink_due = 0u;
    led_write(1u);
    timer2_arm_ms(COMM_BLINK_MS, TIMER2_MODE_COMM_BLINK);
}

static void idle_ping_service(void)
{
    if (!g_idle_ping_armed && !g_idle_ping_due) {
        idle_ping_schedule();
    }
    if (g_idle_ping_due) {
        g_idle_ping_due = 0u;
        uart_send_ping();
        idle_ping_schedule();
    }
}

uint32 psoc_now_ticks(void)
{
    return 0u; /* Compatibilidad para el servo legacy, hoy compilado apagado. */
}

/* Selecciona la ruta en superMaquina. Con ENGINE_ENABLE=0 actúa como bypass
 * para calibración/diagnóstico; con ENGINE_ENABLE=1 decide qué DRQ deja pasar
 * durante captura. Instala además el handler de muestra de bypass que publica
 * la muestra alineada para calibration.c. */
void dma_route_select(uint8 use_filter)
{
    capture_engine_set_source(capture_engine_source_from_stream(use_filter));
    g_sm_sample_handler = (use_filter != 0u) ? sm_sample_cal_filt
                                             : sm_sample_cal_raw;
}

static uint8 psoc_seed_calibration_from_nv(uint8 reset_defaults_if_missing)
{
    uint8 nv_dac[PSOC_NV_CAL_STAGES];
    uint8 stage_count = psoc_calibration_stage_count();

    if (!g_nv_ready || stage_count == 0u || stage_count > PSOC_NV_CAL_STAGES) {
        return 0u;
    }

    if (psoc_nv_load_for_gain(g_pga_code, nv_dac, stage_count)) {
        psoc_calibration_seed_dac(nv_dac, stage_count);
        return 1u;
    }

    if (reset_defaults_if_missing) {
        psoc_calibration_seed_default_dac();
    }
    return 0u;
}

static void PGAgain_Set(uint8 code)
{
    if (code <= 8u) {
        uint8 changed = (g_pga_code != code) ? 1u : 0u;
        g_pga_code = code;
        psoc_hw_set_pga(code);
        if (changed) {
            g_last_calibration_ok = 0u;
            (void)psoc_seed_calibration_from_nv(1u);
        }
    }
}

static void PGAvdac_Set(uint8 code)
{
    if (code <= 8u) {
        g_pgavdac_code = code;
        psoc_hw_set_pgavdac(code);
    }
}

#define CAPTURE_FILTER_EXTRA_BATCHES \
    ((uint16)((FILTER_GROUP_DELAY + BATCH_SAMPLES - 1u) / BATCH_SAMPLES))

static void psoc_arm(void)
{
    uint8 saved;
    uint8 source;
    uint16 total_target = capture_target_batches();
    uint16 hw_target;
    uint16 hw_extra = 0u;
    uint16 decim = (uint16)psoc_adc_get_decimation();
    uint16 discard = 0u;
    uint8 use_sd = 0u;

    runtime_timers_stop_for_quiet_window();
    psoc_prepare_capture_path();
    source = capture_engine_source_from_stream(g_stream_mode);
    if (source == CE_CFG_SRC_FILTER || source == CE_CFG_SRC_COMBINED) {
        discard = FILTER_GROUP_DELAY;
        hw_extra = CAPTURE_FILTER_EXTRA_BATCHES;
    }
#if PSOC_RAMP_DEBUG_ENABLE
    if (source == CE_CFG_SRC_DEBUG) {
        /* La rampa debug (sm_sample_capture_debug) no pasa por el
         * acumulador de decimación — escribe 1:1 sin promediar. No inflar
         * el target de hardware para este modo. */
        decim = 1u;
    }
#endif
#if PSOC_RAMP_DEBUG_ENABLE
    g_capture_align = (source == CE_CFG_SRC_DEBUG) ? 0u : 1u;
#else
    g_capture_align = 1u;
#endif
    g_capture_adc_raw = (source == CE_CFG_SRC_RAW) ? 1u : 0u;

    /* Captura a SD: la decisión y la lectura del directorio (I/O SPI, puede
     * tardar ms) van ANTES de la sección crítica. Si la SD está pedida pero no
     * disponible, se degrada a RAM-only re-clampeando el target. */
    if (g_sd_cap_en && sd_spi_present()
#if PSOC_RAMP_DEBUG_ENABLE
        && (source != CE_CFG_SRC_DEBUG)
#endif
       ) {
        use_sd = sd_session_begin();
    }
    if (!use_sd && (total_target > PSOC_CAPTURE_MAX_BATCHES)) {
        total_target = PSOC_CAPTURE_MAX_BATCHES;
    }

    saved = CyEnterCriticalSection();
    capture_reset_locked(use_sd ? (uint16)PSOC_CAPTURE_MAX_BATCHES : total_target);
    g_sd_cap_active = use_sd;
    g_sd_target_samples = (uint32)total_target * (uint32)BATCH_SAMPLES;
    g_fir_discard = discard;
    g_capture_decim_factor = (uint8)decim;
    g_total_target = total_target;
    g_total_sent   = 0u;
    g_chain_active = 0u;
    g_state = PSOC_ARMED;
    hw_target = capture_next_hw_target(total_target, decim, hw_extra);
    if (((uint32)total_target * (uint32)decim + (uint32)hw_extra) >
        (uint32)PSOC_CAPTURE_MAX_BATCHES) {
        g_chain_active = 1u;
    }
    CyExitCriticalSection(saved);
    capture_engine_configure_target(hw_target);
    capture_engine_set_source(source);
    g_sm_capture_handler = capture_handler_for_source(source);
    g_sm_sample_handler = sm_sample_armed_wait;
    capture_engine_set_enabled(1u, 1u);
    capture_engine_clear_flags();
    capture_engine_pulse(CE_CTRL_ARM);
    ADC_StartConvert();
}

static void psoc_start_now(void)
{
    psoc_prepare_capture_path();
    psoc_enter_sampling(0u);
}

static uint8 capture_rearm_next_chunk(void)
{
    uint8 saved;
    uint8 source;
    uint16 stored;
    uint16 decim;
    uint16 hw_target;

    stored = capture_stored_batches();
    if (g_total_target == 0u || capture_target_samples_reached()) {
        return 0u;
    }
    decim = (uint16)g_capture_decim_factor;
    if (decim == 0u) {
        decim = 1u;
    }

