simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
    source = capture_engine_source_from_stream(g_stream_mode);
#if PSOC_RAMP_DEBUG_ENABLE
    if (g_debug_psoc) {
        source = CE_CFG_SRC_DEBUG;
        decim = 1u;
    }
#endif
    hw_target = capture_next_hw_target(g_total_target, decim, 0u);

    saved = CyEnterCriticalSection();
    g_capture_done = 0u;
    g_capture_wd_due = 0u;
    g_batches_captured = 0u;
    g_batches_sent = 0u;
    g_state = PSOC_SAMPLING;
    CyExitCriticalSection(saved);

#if PSOC_RAMP_DEBUG_ENABLE
    g_capture_align = (source == CE_CFG_SRC_DEBUG) ? 0u : 1u;
#else
    g_capture_align = 1u;
#endif
    g_capture_adc_raw = (source == CE_CFG_SRC_RAW) ? 1u : 0u;
    capture_engine_configure_target(hw_target);
    capture_engine_set_source(source);
    g_sm_capture_handler = capture_handler_for_source(source);
    g_sm_sample_handler = g_sm_capture_handler;
    capture_engine_set_enabled(1u, 0u);
    capture_engine_clear_flags();
    capture_watchdog_arm();
    uart_send_diag(PSOC_EVT_CHAIN_NEXT, diag_u16_sat(stored));
    capture_engine_pulse(CE_CTRL_START_NOW);
    ADC_StartConvert();
    return 1u;
}

static uint8 psoc_start_calibration_if_idle(uint8 send_ack)
{
    uint8 cal_start;

    if (g_state != PSOC_IDLE) {
        uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 0u);
        }
        return 0u;
    }
    g_batches_sent = 0u;
    g_batches_captured = 0u;
    g_capture_done = 0u;
    g_chain_active = 0u;
    g_total_target = 0u;
    g_total_sent = 0u;
    g_last_calibration_ok = 0u;
    psoc_calibration_servo_abort();
    idle_ping_stop();
    comm_led_stop();
    capture_engine_set_enabled(0u, 0u);
    capture_engine_clear_flags();
    /* La calibracion usa targets definidos para el rango ±2.5 V. Si el host
     * dejo seleccionado ±0.512 V, se fuerza 2V5 solo durante esta corrida y
     * se restaura la seleccion al terminar. La ruta DMA/AMux la gobierna
     * cal_pi_stage_begin (calibration.c) por etapa. */
    psoc_adc_select_calibration_config();
    uart_send_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);
    uart_send_diag(PSOC_EVT_CAL_START, 0u);
    cal_start = psoc_calibration_start_async();
    if (cal_start == 2u) {
        g_last_calibration_ok = 1u;
        psoc_adc_cal_override(0u);
        psoc_prepare_capture_path();
        idle_ping_schedule();
        uart_send_diag(PSOC_EVT_CAL_DONE, 1u);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 1u);
        }
        return 1u;
    }
    if (!cal_start) {
        psoc_adc_cal_override(0u);
        psoc_prepare_capture_path();
        uart_send_diag(PSOC_EVT_CAL_DONE, 0u);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 0u);
        }
        return 0u;
    }
    g_cal_ack_pending = send_ack ? 1u : 0u;
    g_state = PSOC_CALIBRATING;
    return 1u;
}

static void psoc_report_adc_snapshot_if_idle(void)
{
    if (g_state != PSOC_IDLE) {
        uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
        uart_send_cfg_ack(PSOC_CMD_ADC_SNAPSHOT, 0u);
        return;
    }

    psoc_calibration_servo_abort();
    capture_engine_set_enabled(0u, 0u);
    capture_engine_clear_flags();
    uart_send_cfg_ack(PSOC_CMD_ADC_SNAPSHOT, 1u);
    psoc_calibration_report_adc_snapshot();
    dma_route_select(g_stream_mode);
}

static uint8 service_button_calibration(void)
{
#if !PSOC_BUTTON_CAL_ENABLE
    return 0u;
#else
    if (!g_cal_button_pressed) {
        return 0u;
    }

    g_cal_button_pressed = 0u;
    if ((g_state == PSOC_ARMED) || (g_state == PSOC_SAMPLING)) {
        /* Política: botón fuera de IDLE se descarta; en ventana crítica ni
         * siquiera se emite diagnóstico UART. */
        return 0u;
    }
    uart_send_diag(PSOC_EVT_BUTTON, g_state);
    if (g_state == PSOC_IDLE) {
        (void)psoc_start_calibration_if_idle(0u);
    } else {
        uart_send_diag(PSOC_EVT_BUTTON_IGNORED, g_state);
    }
    return 1u;
#endif
}

static void uart_send_capture_frame(const volatile uint8 *src)
{
    uint8  frame[FRAME_BYTES];
    uint8 *p;
    uint16 i;
    uint8  crc = 0u;

    frame[0] = 0xABu;
    frame[1] = (uint8)BATCH_SAMPLES;
    frame[2] = (uint8)( g_seq        & 0xFFu);
    frame[3] = (uint8)((g_seq >> 8u) & 0xFFu);

    /* La ISR guarda los 3 bytes crudos del DMA sin procesar; el alineado a
     * counts (division por DEC_DIV) se hace acá, fuera de la ventana crítica
     * de muestreo. La rampa debug va tal cual (g_capture_align=0). */
    p = &frame[4];
    for (i = 0u; i < BATCH_SAMPLES; i++, p += 3u, src += 3u)
    {
        if (g_capture_align) {
            int32 val = psoc_adc_counts_right_aligned(
                g_capture_adc_raw ? dma_buf_to_adc_counts(src) : dma_buf_to_i24(src));
            p[0] = (uint8)( val         & 0xFFu);
            p[1] = (uint8)((val >>  8u) & 0xFFu);
            p[2] = (uint8)((val >> 16u) & 0xFFu);
        } else {
            p[0] = src[0];
            p[1] = src[1];
            p[2] = src[2];
        }
    }

    for (i = 0u; i < (FRAME_BYTES - 1u); i++) { crc ^= frame[i]; }
    frame[FRAME_BYTES - 1u] = crc;

    g_seq++;
    UART_PutArray(frame, FRAME_BYTES);
}

static void uart_send_capture_batch(uint16 batchIndex)
{
    uart_send_capture_frame(&g_capture_raw[(uint32)batchIndex * CAPTURE_BATCH_BYTES]);
}

/* Dump de un lote desde la SD (captura con g_sd_cap_active): lee el bloque de
 * la sesión que lo contiene (caché de 1 bloque en g_sd_blk, los lotes se piden
 * en orden) y manda el frame con el mismo formato que el camino RAM. */
static void uart_send_sd_batch(uint16 batchIndex)
{
    uint32 blk = (uint32)batchIndex / SD_BATCHES_PER_BLOCK;
    uint16 offset = (uint16)((uint32)batchIndex % SD_BATCHES_PER_BLOCK) *
                    CAPTURE_BATCH_BYTES;

    if (blk != g_sd_dump_blk_cached) {
        if (!sd_spi_read_block(g_sd_session_lba + 1u + blk, g_sd_blk)) {
            uint16 i;
            g_sd_err_flags |= 0x08u;
            for (i = 0u; i < SD_BLOCK_BYTES; i++) {
                g_sd_blk[i] = 0u;
            }
        }
        g_sd_dump_blk_cached = blk;
    }
    uart_send_capture_frame(&g_sd_blk[offset]);
}

static void uart_service(void)
{
    uint8 rx;
    while (UART_GetRxBufferSize() > 0u)
    {
        rx = UART_ReadRxData();
        switch (rx_state)
        {
            case 0u:
                if (rx == 0xABu) { rx_state = 1u; rx_watchdog_start(); }
                break;

            case 1u:
                rx_watchdog_start();
                switch (rx)
                {
                    case 0xA5u: case 0xA6u: case 0xA9u: case 0xAAu:
                    case 0xB1u: case 0xB3u: case 0xB4u: case PSOC_CMD_CALIBRATE:
                    case PSOC_CMD_SAVE_EEPROM: case PSOC_CMD_SELECT_STREAM:
                    case PSOC_CMD_ADC_SNAPSHOT: case PSOC_CMD_ADC_CONFIG:
                    case PSOC_CMD_SET_DECIMATION:
                    case PSOC_CMD_SD_STATUS: case PSOC_CMD_SD_TEST:
                    case PSOC_CMD_SD_CAPTURE:
                    case PSOC_CMD_BLINK_LED:
                    case PSOC_CMD_PONG:
                        rx_cmd = rx; rx_state = 2u; break;
                    case 0xA3u:
                        rx_cmd = rx; rx_state = 4u; break;
                    default:
                        rx_watchdog_stop(); rx_state = 0u; break;
                }
                break;

            case 2u:
                rx_p1 = rx; rx_p2 = 0u; rx_state = 3u; rx_watchdog_start();
                break;

            case 4u:
                rx_p1 = rx; rx_state = 5u; rx_watchdog_start();
                break;

            case 5u:
                rx_p2 = rx; rx_state = 3u; rx_watchdog_start();
                break;

