simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
            case 3u:
                rx_watchdog_stop(); rx_state = 0u;
                if (rx != (uint8)(rx_cmd ^ rx_p1 ^ rx_p2)) { break; }

                if (!g_esp_connected) {
                    /* Durante reset/upload del ESP, el TX hacia el PSoC puede
                     * emitir bytes que por casualidad formen un frame valido.
                     * No aceptar comandos de configuracion/captura como
                     * handshake: solo PONG/STATUS abren la comunicacion real. */
                    if (rx_cmd != PSOC_CMD_PONG && rx_cmd != 0xA5u) {
                        break;
                    }
                    g_esp_connected = 1u;
                    uart_send_diag(PSOC_EVT_ESP_SEEN, rx_cmd);
                }
                if (rx_cmd != PSOC_CMD_PONG && rx_cmd != 0xB1u) {
                    uart_send_diag(PSOC_EVT_RX_CMD, rx_cmd);
                }

                if (g_state == PSOC_CALIBRATING) {
                    switch (rx_cmd)
                    {
                        case PSOC_CMD_PONG:
                            break;
                        case 0xA5u:
                            uart_send_diag(PSOC_EVT_STATUS_REQ, 0u);
                            uart_send_ping();
                            uart_send_fs_report();
                            break;
                        case PSOC_CMD_CALIBRATE:
                            uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
                            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 0u);
                            break;
                        case PSOC_CMD_ADC_SNAPSHOT:
                            uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
                            uart_send_cfg_ack(PSOC_CMD_ADC_SNAPSHOT, 0u);
                            break;
                        case 0xA6u: case 0xA9u: case 0xAAu:
                        case 0xB1u: case 0xB3u: case 0xB4u:
                        case PSOC_CMD_ADC_CONFIG:
                        case PSOC_CMD_SET_DECIMATION:
                        case PSOC_CMD_SD_STATUS:
                        case PSOC_CMD_SD_TEST:
                        case PSOC_CMD_SD_CAPTURE:
                            uart_send_diag(PSOC_EVT_CAL_BUSY, rx_cmd);
                            uart_send_cfg_ack(rx_cmd, 0u);
                            break;
                        default:
                            uart_send_diag(PSOC_EVT_CAL_BUSY, rx_cmd);
                            break;
                    }
                    break;
                }

                switch (rx_cmd)
                {
                    case PSOC_CMD_PONG: break;
                    case 0xA5u:
                        uart_send_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);
                        uart_send_diag(PSOC_EVT_STATUS_REQ, 0u);
                        uart_send_ping();
                        uart_send_fs_report();
                        break;
                    case 0xA6u:
                        PGAgain_Set(rx_p1);
                        uart_send_cfg_ack(0xA6u, g_pga_code);
                        led_toggle(); break;
                    case 0xA9u:
                        PGAvdac_Set(rx_p1);
                        uart_send_cfg_ack(0xA9u, g_pgavdac_code);
                        led_toggle(); break;
                    case 0xAAu:
                        /* Legacy command: hardware now uses the four VDAC_ref_* refs. */
                        g_vdac_val = rx_p1;
                        uart_send_cfg_ack(0xAAu, g_vdac_val);
                        led_toggle(); break;
                    case 0xA3u:
                        g_n_batches = (uint16)rx_p1 | ((uint16)rx_p2 << 8u);
                        uart_send_diag(PSOC_EVT_SETN, diag_u16_sat(g_n_batches));
                        break;
                    case 0xB1u:
                        uart_wait_tx_complete_quiet();
                        psoc_arm();
                        break;
                    case 0xB4u:
                        uart_send_diag(PSOC_EVT_START_NOW, 0u);
                        uart_send_cfg_ack(0xB4u, 1u);
                        psoc_start_now();
                        led_toggle();
                        break;
                    case 0xB3u:
#if PSOC_RAMP_DEBUG_ENABLE
                        g_debug_psoc = (rx_p1 == 0u) ? 0u : 1u;
                        uart_send_diag(PSOC_EVT_DEBUG_MODE, g_debug_psoc);
                        if (g_debug_psoc) {
                            psoc_prepare_capture_path();
                            psoc_enter_sampling(1u);
                        } else {
                            uint8 saved;
                            ADC_StopConvert();
                            capture_watchdog_stop();
                            g_sm_sample_handler = sm_sample_noop;
                            capture_engine_set_enabled(0u, 0u);
                            capture_engine_clear_flags();
                            psoc_prepare_capture_path();
                            idle_ping_schedule();
                            saved = CyEnterCriticalSection();
                            capture_reset_locked(capture_target_batches());
                            g_state = PSOC_IDLE;
                            CyExitCriticalSection(saved);
                        }
#else
                        (void)rx_p1;
                        uart_send_diag(PSOC_EVT_DEBUG_MODE, 0u);
#endif
                        break;
                    case PSOC_CMD_CALIBRATE:
                        (void)psoc_start_calibration_if_idle(1u);
                        led_toggle();
                        break;
                    case PSOC_CMD_SAVE_EEPROM:
                        /* Guardar los DAC de calibración actuales en EEPROM.
                         * El gate es vs PSOC_CAL_STAGE_COUNT (2 en HAMMER, no
                         * el tope fijo PSOC_NV_CAL_STAGES=4 del layout EEPROM
                         * — con ese tope fijo HAMMER nunca guardaba nada).
                         * No se pisa el slot si alguna etapa quedó ok=0. */
                        {
                            uint8 dac_snap[PSOC_NV_CAL_STAGES];
                            uint8 ok_snap = 0u;
                            uint8 stage_count = psoc_calibration_stage_count();
                            uint8 k;
                            for (k = 0u; k < PSOC_NV_CAL_STAGES; k++) {
                                dac_snap[k] = 0u;
                            }
                            for (k = 0u; k < PSOC_NV_CAL_STAGES && k < stage_count; k++) {
                                dac_snap[k] = g_psoc_cal_results[k].final_dac;
                            }
                            if (g_last_calibration_ok &&
                                g_psoc_cal_result_count >= stage_count) {
                                ok_snap = 1u;
                                for (k = 0u; k < stage_count; k++) {
                                    if (!g_psoc_cal_results[k].ok) {
                                        ok_snap = 0u;
                                        break;
                                    }
                                }
                                if (ok_snap) {
                                    ok_snap = psoc_nv_save_for_gain(g_pga_code, dac_snap, stage_count);
                                }
                            }
                            uart_send_cfg_ack(PSOC_CMD_SAVE_EEPROM, ok_snap);
                        }
                        led_toggle();
                        break;
                    case PSOC_CMD_SELECT_STREAM:
                        /* rx_p1: 0=crudo, 1=filtrado FIR */
                        g_stream_mode = (rx_p1 != 0u) ? 1u : 0u;
                        if (g_stream_mode != 0u) {
                            (void)psoc_filter_load_fir_coefficients(g_fir_adquisition_coeffs_q23,
                                                                     FILTER_FIR_NTAPS);
                            psoc_filter_reset_history();
                            psoc_adc_clear_isr_filtered_sample();
#ifdef CY_ISR_isr_DMA_Filter_RAM_H
                            isr_DMA_Filter_RAM_ClearPending();
#endif
                        }
                        dma_route_select(g_stream_mode);
                        uart_send_cfg_ack(PSOC_CMD_SELECT_STREAM, g_stream_mode);
                        led_toggle();
                        break;
                    case PSOC_CMD_ADC_CONFIG:
                        if ((g_state == PSOC_IDLE) && psoc_adc_set_config(rx_p1)) {
                            psoc_adc_cal_override(0u);
                            psoc_prepare_capture_path();
                            uart_send_cfg_ack(PSOC_CMD_ADC_CONFIG, psoc_adc_get_config());
                            uart_send_fs_report();
                        } else {
                            uart_send_cfg_ack(PSOC_CMD_ADC_CONFIG, 0u);
                        }
                        led_toggle();
                        break;
                    case PSOC_CMD_ADC_SNAPSHOT:
                        psoc_report_adc_snapshot_if_idle();
                        led_toggle();
                        break;
                    case PSOC_CMD_SET_DECIMATION:
                        if ((g_state == PSOC_IDLE) && psoc_adc_set_decimation(rx_p1)) {
                            uart_send_cfg_ack(PSOC_CMD_SET_DECIMATION, psoc_adc_get_decimation());
                            uart_send_fs_report();
                        } else {
                            uart_send_cfg_ack(PSOC_CMD_SET_DECIMATION, 0u);
                        }
                        led_toggle();
                        break;
                    case PSOC_CMD_SD_STATUS:
                        /* p1=1: re-init completo (solo IDLE); p1=0: estado cacheado. */
                        if ((rx_p1 != 0u) && (g_state == PSOC_IDLE)) {
                            (void)sd_spi_init();
                        }
                        uart_send_diag(PSOC_EVT_SD_STATUS, sd_spi_status_byte());
                        uart_send_cfg_ack(PSOC_CMD_SD_STATUS, sd_spi_status_byte());
                        break;
                    case PSOC_CMD_SD_TEST:
                        if ((g_state == PSOC_IDLE) && sd_spi_present()) {
                            uart_send_cfg_ack(PSOC_CMD_SD_TEST, sd_spi_self_test());
                        } else {
                            uart_send_cfg_ack(PSOC_CMD_SD_TEST, 0u);
                        }
                        led_toggle();
                        break;
                    case PSOC_CMD_SD_CAPTURE:
                        if (g_state != PSOC_IDLE) {
                            uart_send_cfg_ack(PSOC_CMD_SD_CAPTURE, 0xEEu);
                        } else if (rx_p1 == 0u) {
                            g_sd_cap_en = 0u;
                            uart_send_cfg_ack(PSOC_CMD_SD_CAPTURE, 0u);
                        } else if (sd_spi_present()) {
                            g_sd_cap_en = 1u;
                            uart_send_cfg_ack(PSOC_CMD_SD_CAPTURE, 1u);
                        } else {
                            uart_send_cfg_ack(PSOC_CMD_SD_CAPTURE, 0xEEu);
                        }
                        led_toggle();
                        break;
                    case PSOC_CMD_BLINK_LED:
                        /* Identificacion no bloqueante: Timer_2 encadena
                         * one-shots y service_comm_led solo consume flags. */
                        comm_led_start_identify();
                        break;
                    default: break;
                }
                break;

            default:
                rx_state = 0u; break;
        }
    }
}

/* Recuperación tras el breaker de tormenta de IRQ: re-inicializa el bloque
 * (Enable deja propagar cualquier clear latcheado, doble lectura de status,
 * pend limpio) y restaura el estado software del modo que estaba en vuelo
 * para que ninguna espera quede huérfana. */
static void timer_storm_recover(void)
{
    uint8 mask;
    uint8 saved;

    if (g_timer_storm == 0u) { return; }
    saved = CyEnterCriticalSection();
    mask = g_timer_storm;
    g_timer_storm = 0u;
    CyExitCriticalSection(saved);

    if (mask & 0x01u) {
        Timer_Enable();
        (void)Timer_ReadStatusRegister();
        Timer_Stop();
        (void)Timer_ReadStatusRegister();
        isr_Timer_ClearPending();
        if (rx_state != 0u) {
            watchdog_rx = 1u;   /* resincroniza el parser a mano */
        }
        uart_send_diag(PSOC_EVT_TIMER_STORM, 0u);
    }
    if (mask & 0x02u) {
        uint8 mode;
        Timer_1_Enable();
        (void)Timer_1_ReadStatusRegister();
        Timer_1_Stop();
        (void)Timer_1_ReadStatusRegister();
        isr_Timer_1_ClearPending();
        saved = CyEnterCriticalSection();
        mode = g_timer1_mode;
        g_timer1_mode = TIMER1_MODE_NONE;
        g_timer1_remaining_counts = 0u;
        if (mode == TIMER1_MODE_BOOT_PING) {
            g_boot_ping_due = 1u;
        } else if (mode == TIMER1_MODE_IDLE_PING) {
            g_idle_ping_due = 1u;
            g_idle_ping_armed = 0u;
        }
        CyExitCriticalSection(saved);
        if (mode == TIMER1_MODE_CAL_TICK && g_cal_timer_active) {
            /* Reproduce la cadena del tick de calibración. */
            g_cal_progress_due = 1u;
            timer1_arm_ms(g_cal_progress_period_ms, TIMER1_MODE_CAL_TICK);
        }
        uart_send_diag(PSOC_EVT_TIMER_STORM, 1u);
    }
    if (mask & 0x04u) {
        uint8 mode;
        Timer_2_Enable();
        (void)Timer_2_ReadStatusRegister();
        Timer_2_Stop();
        (void)Timer_2_ReadStatusRegister();
        isr_Timer_2_ClearPending();
        saved = CyEnterCriticalSection();
        mode = g_timer2_mode;
        g_timer2_mode = TIMER2_MODE_NONE;
        g_timer2_remaining_counts = 0u;
        if (mode == TIMER2_MODE_BOOT_LED_OFF) {
            g_boot_led_off_due = 1u;
        } else if (mode == TIMER2_MODE_WAIT) {
            g_timer2_wait_done = 1u;
        } else if (mode == TIMER2_MODE_COMM_BLINK) {
            g_comm_blink_due = 1u;
        }
        CyExitCriticalSection(saved);
        uart_send_diag(PSOC_EVT_TIMER_STORM, 2u);
    }
    if (mask & 0x08u) {
        Timer_3_Enable();
        (void)Timer_3_ReadStatusRegister();
        Timer_3_Stop();
        (void)Timer_3_ReadStatusRegister();
        isr_Timer_3_ClearPending();
        g_timer3_remaining_counts = 0u;
        if (g_state == PSOC_SAMPLING && g_capture_done == 0u) {
            capture_watchdog_arm();   /* re-arma la ventana completa */
        }
        uart_send_diag(PSOC_EVT_TIMER_STORM, 3u);
    }
}

static void service_runtime(void)
{
    if ((g_state == PSOC_ARMED) || (g_state == PSOC_SAMPLING)) {
        /* Ventana crítica: la única actividad secundaria permitida es el
         * watchdog de captura (troceado del Timer_3). uart/ping/led quedan
         * holdeados en su STATUS_TC hasta volver a un estado tranquilo. */
        (void)capture_engine_poll_capture_wd();
        service_timer_events(CE_TIMER_EVT_CAPTURE_WD);
    } else {
        (void)capture_engine_poll_timer_events();
        service_timer_events(CE_TIMER_EVT_MASK);
        timer_storm_recover();
    }

    if (g_state == PSOC_CALIBRATING) {
        if (psoc_calibration_service_async()) {
            uint8 ok = psoc_calibration_async_result_ok();
            g_state = PSOC_IDLE;
            g_last_calibration_ok = ok ? 1u : 0u;
            psoc_adc_cal_override(0u);
            psoc_prepare_capture_path();
            idle_ping_schedule();
            uart_send_diag(PSOC_EVT_CAL_DONE, ok);
            if (g_cal_ack_pending) {
                g_cal_ack_pending = 0u;
                uart_send_cfg_ack(PSOC_CMD_CALIBRATE, ok);
            }
        }
        uart_service();
        return;
    }

    if (g_state == PSOC_ARMED) {
        return;   /* HOT_WAIT silencioso: sin UART RX/TX, LED ni pings. */
    }

    if (g_state == PSOC_SAMPLING) {
        uint8 capture_error = g_ce_error;
        uint8 capture_watchdog = 0u;
        if (g_capture_done == 0u) {
            if (g_sd_cap_active) {
                /* Drenaje concurrente ring→SD. No toca UART/timers, así que
                 * respeta la política de silencio de la ventana de muestreo. */
                sd_capture_drain(0u);
            }
            if (!g_capture_wd_due) {
                return;   /* Silencio total: sin UART RX/TX, sin LED, sin pings. */
            }
            /* Watchdog: la captura no llegó a DONE en el tiempo esperado
             * (ADC parado, DMA sin disparos, sync perdido...). Abortar con
             * diagnóstico en vez de quedar mudo para siempre. */
            g_capture_wd_due = 0u;
            g_sm_sample_handler = sm_sample_noop;
            capture_engine_pulse(CE_CTRL_STOP);
            uart_send_diag(PSOC_EVT_CAPTURE_WATCHDOG, state_Read());
            g_capture_done = 1u;
            capture_watchdog = 1u;
        }
        ADC_StopConvert();
        capture_watchdog_stop();
        g_sm_sample_handler = sm_sample_noop;
        capture_engine_set_enabled(0u, 0u);
        capture_engine_clear_flags();
        /* Lotes completos realmente escritos por la ISR (los parciales de un
         * aborto se descartan). */
        g_batches_captured = capture_stored_batches();
        if (capture_error == 0u && capture_watchdog == 0u &&
            g_total_target > 0u && !capture_target_samples_reached()) {
            if (capture_rearm_next_chunk()) {
                return;
            }
        }
        if (g_sd_cap_active) {
            /* Fin real de la captura: vaciar el ring a SD y persistir la
             * sesión (header + directorio) antes de arrancar el dump UART. */
            sd_capture_drain(1u);
            sd_session_finalize(g_batches_captured);
        }
        idle_ping_schedule();
        uart_send_diag(PSOC_EVT_CAPTURE_DONE,
                       (capture_error != 0u) ? capture_error : diag_u16_sat(g_batches_captured));
        g_ce_error = 0u;
        g_capture_done = 0u;
        g_state = PSOC_IDLE;
    }

    if (capture_dump_pending()) {
        if (g_batches_sent == 0u) {
            uart_send_diag(PSOC_EVT_DUMP_START, diag_u16_sat(g_batches_captured));
        }
        if (g_sd_cap_active) {
            uart_send_sd_batch(g_batches_sent);
        } else {
            uart_send_capture_batch(g_batches_sent);
        }
        g_batches_sent++;
        if (!capture_dump_pending()) {
            g_total_sent = g_batches_sent;
            g_chain_active = 0u;
            uart_send_diag(PSOC_EVT_DUMP_DONE, diag_u16_sat(g_batches_sent));
        }
        return;
    }

    if (watchdog_rx) { watchdog_rx = 0u; rx_state = 0u; }

